[
  {
    "title": "Apple Inc AAPL:NASDAQ - Stock Price, Quote and News - CNBC",
    "summary": "",
    "url": "https://www.cnbc.com/quotes/%20AAPL",
    "source": "",
    "original_score": 0.6321622,
    "custom_score": 0.18964866,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:16:18.811583",
    "full_content": "Apple Inc AAPL:NASDAQ\n- Open228.06\n- Day High230.72\n- Day Low228.06\n- Prev Close228.52\n- 52 Week High237.49\n- 52 Week High Date10/15/24\n- 52 Week Low164.07\n- 52 Week Low Date04/19/24\nKey Stats\n- Market Cap3.475T\n- Shares Out15.12B\n- 10 Day Average Volume42.03M\n- Dividend1.00\n- Dividend Yield0.44%\n- Beta1.23\n- YTD % Change19.39\nKEY STATS\n- Open228.06\n- Day High230.72\n- Day Low228.06\n- Prev Close228.52\n- 52 Week High237.49\n- 52 Week High Date10/15/24\n- 52 Week Low164.07\n- 52 Week Low Date04/19/24\n- Market Cap3.475T\n- Shares Out15.12B\n- 10 Day Average Volume42.03M\n- Dividend1.00\n- Dividend Yield0.44%\n- Beta1.23\n- YTD % Change19.39\nRATIOS/PROFITABILITY\n- EPS (TTM)6.07\n- P/E (TTM)37.87\n- Fwd P/E (NTM)31.06\n- EBITDA (TTM)134.661B\n- ROE (TTM)157.41%\n- Revenue (TTM)391.035B\n- Gross Margin (TTM)46.21%\n- Net Margin (TTM)23.97%\n- Debt To Equity (MRQ)187.23%\nEVENTS\n- Earnings Date01/30/2025(est)\n- Ex Div Date11/08/2024\n- Div Amount0.25\n- Split Date-\n- Split Factor-\nLatest On Apple Inc\nContent From Our Affiliates\nThere is no recent news for this security.",
    "word_count": 175,
    "extraction_method": "handle_default"
  },
  {
    "title": "AAPL: Apple Inc - Stock Price, Quote and News - CNBC",
    "summary": "",
    "url": "https://www.cnbc.com/quotes/AAPL",
    "source": "",
    "original_score": 0.05572029,
    "custom_score": 0.016716086999999998,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:16:55.836622",
    "full_content": "Apple Inc AAPL:NASDAQ\n- Open228.06\n- Day High230.72\n- Day Low228.06\n- Prev Close228.52\n- 52 Week High237.49\n- 52 Week High Date10/15/24\n- 52 Week Low164.07\n- 52 Week Low Date04/19/24\nKey Stats\n- Market Cap3.475T\n- Shares Out15.12B\n- 10 Day Average Volume42.03M\n- Dividend1.00\n- Dividend Yield0.44%\n- Beta1.23\n- YTD % Change19.39\nKEY STATS\n- Open228.06\n- Day High230.72\n- Day Low228.06\n- Prev Close228.52\n- 52 Week High237.49\n- 52 Week High Date10/15/24\n- 52 Week Low164.07\n- 52 Week Low Date04/19/24\n- Market Cap3.475T\n- Shares Out15.12B\n- 10 Day Average Volume42.03M\n- Dividend1.00\n- Dividend Yield0.44%\n- Beta1.23\n- YTD % Change19.39\nRATIOS/PROFITABILITY\n- EPS (TTM)6.07\n- P/E (TTM)37.87\n- Fwd P/E (NTM)31.06\n- EBITDA (TTM)134.661B\n- ROE (TTM)157.41%\n- Revenue (TTM)391.035B\n- Gross Margin (TTM)46.21%\n- Net Margin (TTM)23.97%\n- Debt To Equity (MRQ)187.23%\nEVENTS\n- Earnings Date01/30/2025(est)\n- Ex Div Date11/08/2024\n- Div Amount0.25\n- Split Date-\n- Split Factor-",
    "word_count": 159,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple Inc. Stock Quote (Switzerland - AAPL.USD - MarketWatch",
    "summary": "",
    "url": "https://www.marketwatch.com/investing/stock/aapl.usd?countrycode=ch",
    "source": "",
    "original_score": 0.5225829,
    "custom_score": 0.15677486999999998,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:17:07.770037",
    "full_content": "AAPL.USD Stock Price | Apple Inc. Stock Quote (Switzerland: SWX\t) | MarketWatch\nMarket Data\nS&P 500 Movers\nSMCI\n11.6\nCPRT\n10.2\nMRNA\n7.5\nDECK\n5.6\nINTU\n-5.7\nPANW\n-3.6\nNTAP\n-3.4\nNVDA\n-3.2\nUS\nEurope\nAsia\nFX\nRates\nFutures\nCrypto\nRange\nDropdown Markets\n1D\n5D\n1M\n3M\n6M\n1Y\n2Y\nDow\n44,296.51\n426.16\n0.97%\nS&P 500\n5,969.34\n20.63\n0.35%\nNasdaq\n19,003.65\n31.23\n0.16%\nVIX\n15.24\n-1.63\n-9.66%\nGold\n2,718.20\n6.00\n0.22%\nOil\n71.19\n-0.05\n-0.07%\nLatest News\nAll Times Eastern\nscroll up\nscroll down\n4:05p\nWill inflation stick around? What oil, gold and stocks are signaling about rising prices.\n3:54p\nMore retailers squeeze in earnings reports before Black Friday with holidays and tariffs in focus\n3:44p\nIsrael says rabbi who went missing in UAE was killed in ‘terror incident’\n3:18p\nIt’s no ‘Barbenheimer,’ but ‘Wicked’ and ‘Gladiator II’ deliver welcome box-office boost\n3:09p\nRepublicans lash out at Democrats’ claims that Trump’s intelligence pick Tulsi Gabbard is ‘compromised’\n2:57p\nFrom bibles to sneakers to guitars: Trump-branded merchandise is everywhere, but could it create legal woes for the president-elect?\n2:45p\nBarron's\nThanksgiving Dinner Will Cost 5% Less This Year\n2:00p\nBarron's\nBest Buy, Zoom, CrowdStrike, Macy’s, and More Stocks to Watch This Week\n1:21p\nBarron's\nWicked, Gladiator II Light Up Weekend Box Office\n12:46p\nBarron's\nElon Musk Versus Lockheed? Say It Ain’t So.\nHome\nInvesting\nQuotes\nStocks\nSwitzerland\nAAPL.USD\nOverview\nStock Screener\nEarnings Calendar\nSectors\nSearch Ticker\n|\nAAPL.USD\nSwitzerland: SWX\nApple Inc.\nWatch\nlist\nAAPL.USD\nCH\nClosed\nLast Updated:\nJan 3, 2022 5:35 p.m.\nCEST\nDelayed quote\n$\n497.15\n295.00\n145.93%\nPrevious Close\n$202.15\nToggle Chart Options\nAdvanced Charting\n1D\n5D\n1M\n3M\n6M\nYTD\n1Y\n3Y\nAll\nRange Dropdown\n$\n%\nVol\n201.80\nDay Range\n497.15\nCustomize MarketWatch\nHave Watchlists? Log in to see them here or sign up to get started.\nCreate Account\n… or\nLog In\nSymbol\nCompany\nPrice\nChg/Chg %\n(\nGo to Your Watchlist\n)\nNo Items in Watchlist\nThere are currently no items in this Watchlist.\nAdd Tickers\nNo Saved Watchlists\nCreate a list of the investments you want to track.\nCreate Watchlist\n…or\nlearn more\nUh oh\nSomething went wrong while loading Watchlist.\nGo to Watchlist\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSearch Tickers\nOverview\nProfile\nCharts\nFinancials\nHistorical Quotes\nPremium Tools\nOpen\n$201.80\nDay Range\n201.80 - 497.15\n52 Week Range\nN/A\nMarket Cap\nN/A\nShares Outstanding\nN/A\nPublic Float\nN/A\nBeta\nN/A\nRev. per Employee\nN/A\nP/E Ratio\nN/A\nEPS\nN/A\nYield\nN/A\nDividend\nN/A\nEx-Dividend Date\nN/A\nShort Interest\nN/A\n% of Float Shorted\nN/A\nAverage Volume\nN/A\nSell\nUnder\nHold\nOver\nBuy\nNumber of Ratings\n52\nFull Ratings\nMarketWatch\nDow Jones\nNo Headlines Available\nNo Headlines Available\nOther News\nPress Releases\nNo Headlines Available\nNo Headlines Available\nApple, Inc. engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other varieties of related services. It operates through the following geographical segments: Americas, Europe, Greater China, Japan, and Rest of Asia Pacific. The Americas segment includes North and South America. The Europe segment consists of European countries, as well as India, the Middle East, and Africa. The Greater China segment comprises China, Hong Kong, and Taiwan. The Rest of Asia Pacific segment includes Australia and Asian countries. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, AppleCare, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak in April 1976 and is headquartered in Cupertino, CA.\nName\nChg %\nMarket Cap\nRTX A/S\n0.57%\nkr.560.73M\nSustainion Group AB\n0.93%\nkr89.35M\nSay Yenilenebilir Enerji Ekipmanlari Sanayi ve Ticaret A.S.\n0.14%\n₺3.39B\nClose Trending Tickers bar\nAZTA\n$43.16\n-4.43%\n-2.00\nFLEX\n$41.34\n0.10%\n0.04\nPDYN\n$4.80\n4.35%\n0.20\nWPM\n$64.00\n0.30%\n0.19\nAccess Premium Tools\nSearch\nClear\nSearch\nAdvanced Search\nSymbols\nLoading...\nPrivate Companies\nLoading...\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSearch Tickers\nAll News\nArticles\nVideo\nPodcasts\nAuthors\nSections\nColumns\n×\n×\nThis browser is no longer supported at MarketWatch. For the best MarketWatch.com experience, please update to a modern browser.\nChrome\nSafari\nFirefox\nEdge",
    "word_count": 709,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple commits $1.5 billion to Globalstar for iPhone satellite services",
    "summary": "",
    "url": "https://www.cnbc.com/2024/11/01/apple-commits-1point5-billion-to-globalstar-for-iphone-satellite-services.html",
    "source": "",
    "original_score": 0.049405243,
    "custom_score": 0.0148215729,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:17:59.462208",
    "full_content": "Apple committed about $1.5 billion to satellite communications company Globalstar to fund the expansion of iPhone services, the companies disclosed in a securities filing on Friday.\nThe tech giant's deal with Globalstar includes $1.1 billion in cash, of which $232 million will go toward the satellite company's current debt, and a 20% equity stake. The deal is expected to close on Tuesday.\nApple has already been spending hundreds of millions for Globlastar services, which enabled the 2022 rollout of iPhone emergency satellite texting.\nIt is one of several efforts in the direct-to-device, or D2D, satellite connectivity market — which provides service to unmodified devices such as smartphones directly from space — with other projects underway from SpaceX, AST SpaceMobile, Iridium, Lynk and EchoStar.\nGlobalstar stock jumped 31.4% in Friday trading to close at $1.38 a share.\nIn the filing, Globalstar noted that it will continue to allocate about 85% of its network capacity to Apple.\nThe new funds will allow Globalstar to purchase new satellites and expand its ground infrastructure. Globalstar currently operates 31 satellites and has already ordered as many as 26 satellites to replenish and upgrade its constellation in low Earth orbit.",
    "word_count": 194,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple (AAPL) Q4 2024 Earnings Call Transcript | The Motley Fool",
    "summary": "",
    "url": "https://www.fool.com/earnings/call-transcripts/2024/10/31/apple-aapl-q4-2024-earnings-call-transcript/",
    "source": "",
    "original_score": 0.85931,
    "custom_score": 0.557793,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:19:37.981762",
    "full_content": "Apple (AAPL 0.59%)\nQ4 2024 Earnings Call\nOct 31, 2024, 5:00 p.m. ET\nContents:\n- Prepared Remarks\n- Questions and Answers\n- Call Participants\nPrepared Remarks:\nSuhasini Chandramouli -- Director, Investor Relations\nGood afternoon, and welcome to the Apple Q4 fiscal year 2024 earnings conference call. My name is Suhasini Chandramouli, director of investor relations. Today's call is being recorded. Speaking first today are Apple's CEO, Tim Cook; and CFO, Luca Maestri; and they'll be joined by Kevan Parekh, vice president of financial planning and analysis.\nAfter that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation, and future business outlook, including the potential impact of macroeconomic conditions on the company's business and results of operations. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast. For more information, please refer to the risk factors discussed in Apple's most recently filed annual report on Form 10-K and the Form 8-K filed with the SEC today, along with the associated press release.\nApple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Additionally, today's discussion will refer to certain non-GAAP financial measures. You can find a reconciliation of these measures in our fourth quarter and full year 2024 earnings release, which is available on our Investor Relations website. I'd now like to turn the call over to Tim for introductory remarks.\nTimothy Donald Cook -- Chief Executive Officer\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. Today, Apple is reporting revenue of $94.9 billion, a September quarter record and up 6% from a year ago. iPhone grew in every geographic segment, marking a new September quarter revenue record for the category, and services set an all-time revenue record, up 12% year over year.\nWe also set September quarter segment revenue records in the Americas, Europe, and the rest of Asia Pacific as well as in a large number of countries, including the United States, Brazil, Mexico, France, the U.K., Korea, Malaysia, Thailand, Saudi Arabia, and the UAE. And we continue to be excited by the enthusiasm we're seeing in India, where we set an all-time revenue record. This has been an extraordinary year of innovation at Apple. We brought the revolutionary Apple Vision Pro to customers in February, which brings users tomorrow's technology today.\nAnd in June, we announced Apple Intelligence, a remarkable personal intelligent system that combines the power of generative models with personal context to deliver intelligence that is incredibly useful and relevant. Apple Intelligence marks the beginning of a new chapter for Apple Innovation and redefines privacy and AI by extending our groundbreaking approach to privacy into the cloud with private cloud compute. Earlier this week, we made the first set of Apple Intelligence features available in U.S. English for iPhone, iPad, and Mac users with systemwide writing tools that help you refine your writing, a more natural and conversational Siri, a more intelligent Photos app, including the ability to create movies simply by typing a description, and new ways to prioritize and stay in the moment with notification summaries and priority messages.\nAnd we look forward to additional intelligence features in December with even more powerful writing tools, a new visual intelligence experience that builds on Apple Intelligence and ChatGPT integration as well as localized English in several countries, including the U.K., Australia, and Canada. These features have already been provided to developers, and we're getting great feedback. More features will be rolling out in the coming months as well as support for more languages, and this is just the beginning. Now, I'll turn to our results for the quarter, beginning with iPhone.\niPhone revenues set a September quarter record of $46.2 billion, up 6% from a year ago with growth in every geographic segment. With the introduction of Apple Intelligence, we're beginning a new era for iPhone. iPhone 16 powered by 18 is equipped with an incredible new 48-megapixel Fusion camera, fantastic photo experiences, and the addition of the action button and camera control. And iPhone 16 Pro is the most advanced iPhone we've ever made, powered by A18 Pro and featuring even larger displays, an industry-leading pro camera system with camera control, and studio-quality mics, all with a huge leap in battery life.\nTurning to Mac. Revenue was $7.7 billion, up 2% from a year ago. Just this week, we brought a new generation of Apple silicon to Mac, M4, M4 Pro, and M4 Max. From blazing-fast performance to Apple's most advanced neural engine yet, our latest chips can easily tackle incredibly complex workflows.\nAnd they ensure our newest Macs will be the best personal computers for AI the instant they hit stores. With the newest additions to our Mac lineup, customers can choose the Mac that's just right for them. Whether that's iMac, the world's best and most beautiful all-in-one; MacBook Air, the world's most popular laptop now with double the starting memory; MacBook Pro, the best pro notebook anywhere; or the incredible mighty new Mac mini, our first-ever carbon-neutral Mac. iPad revenue was $7 billion, 8% higher year over year.\niPad is unlike any other product on the market today, and it's become an essential device in homes, schools, and businesses of all sizes. Recently, we were thrilled to introduce the newest iPad mini featuring an ultra-compact design built for Apple Intelligence with support for Apple Pencil Pro. It's been a big year for iPad. iPad Air was popular with students and teachers as they got back to school this year, while creators are pushing the boundaries of what's possible with the M4-powered iPad Pro.\nIn Wearables, Home, and Accessories, revenue was $9 billion, down 3% from a year ago. During the quarter, we launched the all-new Apple Watch Series 10, bringing a beautiful new design and new capabilities to the world's most popular watch that make it even more powerful, intelligent, and sophisticated. It's the thinnest Apple Watch yet, making it more comfortable than ever while offering the biggest, most advanced display. watchOS 11 brings some huge new health and fitness insights to users including sleep apnea notifications, which help to alert people with a potentially serious but often undiagnosed condition.\nWe're proud of the impact we make through our health innovations on Watch, and I'm grateful for every note I receive about the importance of watching people's lives. With AirPods 4, we've broken new ground in comfort and design with our best-ever open-ear headphones available for the first time with active noise cancellation. And we were especially pleased to unveil revolutionary end-to-end hearing health capabilities for AirPods Pro 2 with hearing protection, hearing test, and hearing aid features. These just became available in a software update this week, and we believe this will make a meaningful difference in our users' lives.\nI've already started getting notes from customers calling the experience life-changing. And Apple Vision Pro continues to deliver special experiences that weren't possible before, including immersive entertainment like the new short film, Submerged, which gives people a view into the unique storytelling power made possible by spatial computing. Vision Pro has more than 2,500 native spatial apps and 1.5 million compatible apps for visionOS 2 as well as applications companies are building to reimagine how they work. Vision Pro continues to inspire awe in its users, and we're just scratching the surface of what's possible.\nAnd just yesterday, we announced we're bringing Vision Pro to Korea and the UAE. As I mentioned earlier, Services achieved an all-time revenue record of $25 billion, up 12% from a year ago and with all-time revenue records across most of our categories. With Apple TV+, we love celebrating the craft of great storytellers who know how to put on a show. Audiences love to discover new movies like Wolfs, explore acclaimed new series like Disclaimer, and dive back into returning favorites like Slow Horses and Shrinking.\nApple TV+ productions have become fixtures at award shows earning more than 2,300 nominations and more than 500 wins today. Apple also offers a live sports experience in a league of its own with MLS Season Pass, and subscribers have been cheering on their favorite teams in the MLS Cup Playoffs. This month, we also marked 10 years of Apple Pay. There's always something magical about being able to buy groceries or pay for movie tickets seamlessly with your Apple device.\nToday, users choose Apple Pay for purchases across tens of millions of retailers worldwide. And we're excited to make the Apple Pay experience even better with the option to redeem rewards and access loans from credit cards, debit cards, and other lenders right at checkout. Whenever we celebrate big moments, Apple Stores are the best places to share them with customers. I had an incredible time during launch day in September alongside our team at Apple Fifth Avenue where energy and enthusiasm filled the air.\nAnd in stores all over the world, customers are eager to get a closer look at our latest innovations. We also opened two new stores during the quarter, and we can't wait to bring four new stores to customers in India. We're passionate about education and believe technology has a vital role to play in both helping teachers to inspire their students and students to learn about the world around them. In honor of World Teachers' Day, Apple was proud to share new resources for teachers to engage their students in ways that aim to make learning easy and fun.\nAdditionally, we've expanded our education grant program into 100 new schools and communities helping with everything from access to technology to educator resources to scholarships and financial support. As we near the end of the year, we're proud of the progress we've made in our efforts to be carbon-neutral across our entire footprint by the end of the decade. As I mentioned earlier, we were thrilled to introduce our first-ever carbon-neutral Mac with the latest Mac mini. And in another milestone, customers can choose a carbon-neutral option of any Apple Watch.\nThese achievements are amazing for all of us at Apple, and we are determined to reach our 2030 goal. At Apple, across everything we do, we manage for the long term because we're always thinking about what comes next, the next great challenge, the next innovative idea, the next big breakthrough. As we close out the year, we have the best lineup we've ever had going into the holiday season, including Apple Intelligence, which marks the start of a new chapter for our products. This is just the beginning of what we believe generative AI can do, and I couldn't be more excited for what's to come.\nBefore I hand it over to Luca, with Luca transitioning to a new role with Apple, this will be the final time he's joining our call. So, I just wanted to take a moment to recognize his extraordinary service as Apple's CFO and to thank him for his partnership. I am deeply grateful. In his 10 years in the role, Luca has done truly exceptional work in shaping Apple as we know it today.\nHe has helped manage Apple for the long term thoughtfully and deliberately. He has helped us enrich the lives of so many around the world, and he has been a leader that people look up to and have learned so much from. I have incredible confidence in our incoming CFO, Kevan Parekh, and we look forward to more of you meeting and working with him going forward. With that, I'll turn it over to Luca.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nGood afternoon, everyone, and thank you, Tim, for the very kind words. Serving as Apple's CFO has been a real privilege and an amazing journey, and I've greatly appreciated the support from our investors and the analyst community over the years. Kevan is exceptional, and I know you will enjoy interacting with him going forward. Let me now turn to the results for the fourth quarter of our fiscal year.\nWe are very pleased to report a new September quarter revenue record of $94.9 billion, up 6% year over year. We grew in the vast majority of the markets we track and achieved September quarter revenue records in the Americas, Europe, and rest of Asia Pacific. Products revenue was $70 billion, up 4% year over year, driven by growth in iPhone, iPad and Mac. Our installed base of active devices reached an all-time high across all products and geographic segments, thanks to very high levels of customer satisfaction and loyalty, and a large number of customers who are new to our products.\nServices revenue reached an all-time record of $25 billion, up 12% year over year. We saw broad-based strength around the world, reaching all-time records in both developed and emerging markets with double-digit growth and record results across most services categories. Company gross margin was 46.2%, near the high end of our guidance range. Products gross margin was 36.3%, up 100 basis points sequentially, primarily driven by favorable mix.\nServices gross margin was 74%, unchanged from the prior quarter. Operating expenses of $14.3 billion were at the midpoint of the guidance range we provided at the beginning of the quarter and up 6% year over year. During the quarter, we recorded a one-time income tax charge of $10.2 billion, which relates to the impact of the reversal of the European General Court's State Aid decision. When we exclude this one-time charge, net income was $25 billion and diluted earnings per share were $1.64, up 12% year over year and a September quarter record.\nOperating cash flow was very strong at $26.8 billion, a new September quarter record. Let me now get into more detail for each of our revenue categories. iPhone revenue was $46.2 billion, up 6% year over year and a September quarter record in total and across several markets, including the U.S., the Middle East, Korea, and South Asia. The iPhone active installed base grew to a new all-time high in total and in every geographic segment.\nDuring the September quarter, many iPhone models were among the top-selling smartphones around the world. In fact, according to a survey from Kantar, iPhone was the top-selling model in the U.S., urban China, the U.K., Australia, and Japan. We continue to see high levels of customer satisfaction for the iPhone 15 family with 451 Research recently measuring it at 98% in the U.S. Mac revenue was $7.7 billion, up 2% year over year, driven by the strength in MacBook Air.\nCustomers have been loving the performance of Apple silicon on Mac, and we are very excited to bring the latest M4 family of chips to the lineup. The Mac installed base reached an all-time high with about half of customers in the quarter being new to Mac. And in the latest reports from 451 Research, customer satisfaction was 95% in the U.S. iPad generated $7 billion in revenue, up 8% year over year.\nIn addition to growth in developed markets, we also saw strong performance in many emerging markets with double-digit growth in Mexico, Brazil, the Middle East, India, and South Asia. The iPad installed base reached another all-time high, and over half of the customers who purchased iPads during the quarter were new to the product. Also, customer satisfaction was recently measured at 97% in the U.S. Wearables, Home, and Accessories revenue was $9 billion, down 3% year over year.\nThe Apple Watch installed base reached a new all-time high with over half of customers purchasing an Apple Watch during the quarter being new to the product. And the latest reports from 451 Research indicated customer satisfaction of 96% for Watch in the U.S. Our Services revenue reached an all-time record of $25 billion, growing 12% year over year. Services continued to see strong momentum with the growth of our installed base of active devices setting a solid foundation for the future expansion of our ecosystem.\nAnd we see increased customer engagement with our Services offerings. Both transacting accounts and paid accounts reached a new all-time high with paid accounts growing double digits year over year. Paid subscriptions also grew double digits. We have well over 1 billion paid subscriptions across the services on our platform, more than double the number we had only four years ago.\nAnd as always, we remain focused on improving the breadth and quality of our services from new games on Apple Arcade to new features like Tap to Cash and pay with installments using Apple Pay to many successful new and returning shows on Apple TV+. This past quarter, we celebrated the five-year anniversary of Apple Card, which was ranked No. 1 in customer satisfaction among co-branded credit cards by J.D. Power for the fourth year in a row.\nTurning to enterprise. We continue to see strong demand across our products and services. NVIDIA launched its Mac as a choice program supported by AppleCare for Enterprise and Apple Professional Services with over 10,000 Macs deployed worldwide. And Novartis, a leading global pharmaceutical company, recently chose iPhone 16 as the standard mobile device for all employees.\nWe also see continued momentum with Apple Vision Pro in the enterprise space. UC San Diego Health is the first hospital in the world to test spatial computing apps on Apple Vision Pro in clinical trials for patient surgery in the operating room. Let me now turn to our cash position and capital return program. We ended the quarter with $157 billion in cash and marketable securities.\nWe repaid $2.6 billion in maturing debt and increased commercial paper by $7 billion, leaving us with total debt of $107 billion. As a result, net cash was $50 billion at the end of the quarter. During the quarter, we returned over $29 billion to shareholders, including $3.8 billion in dividends and equivalents and $25 billion through open market repurchases of 112 million Apple shares. As we move ahead into the December quarter, I'd like to review our outlook, which includes the types of forward-looking information that Suhasini referred to at the beginning of the call.\nThe color we are providing today assumes that the macroeconomic outlook doesn't worsen from what we are projecting today for the current quarter. We expect our December quarter total company revenue to grow low to mid-single digits year over year. We expect services revenue to grow double digits at a rate similar to what we reported in the fiscal year 2024. We expect gross margin to be between 46% and 47%.\nWe expect opex to be between $15.3 billion and $15.5 billion. We expect OI&E to be around negative $250 million, excluding any potential impact from the mark-to-market of minority investments, and our tax rate to be around 16%. Finally, today, our board of directors has declared a cash dividend of $0.25 per share of common stock payable on November 14, 2024, to shareholders of record as of November 11, 2024. With that, let us open the call to questions.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you, Luca. We ask that you limit yourself to two questions. Operator, may we have the first question, please?\nQuestions & Answers:\nOperator\nCertainly. We will go ahead and take our first question from Michael Ng with Goldman Sachs. Please go ahead.\nMichael Ng -- Goldman Sachs -- Analyst\nHey. Good afternoon. I just have two. The first one is for Tim on Apple Intelligence.\nI was wondering if you could just expand a little bit on some of the early feedback to Apple Intelligence, both for iOS 18.1 but also the developer beta so far, and whether you would attribute Apple Intelligence to any of the strong iPhone performance that we've seen to date. Thanks.\nTimothy Donald Cook -- Chief Executive Officer\nThanks, Michael. As I noted in my comments, just this week on Monday, we made the first set of Apple Intelligence features available in U.S. English for iPhone, iPad, and Mac. And this includes things like systemwide writing tools that help you refine your writing, a more natural conversational Siri, more intelligent Photos app, including the ability to create movies simply by typing a description, which is really cool, and new ways to prioritize and stay in the moment with notification summaries and priority messages.\nThere's also email summaries and email priority. We're getting a lot of positive feedback from developers and customers. And in fact, if you just look at the first three days, which is all we have obviously from Monday, the 18.1 adoption is twice as fast as the 17.1 adoption was in the year-ago quarter. And so, there's definitely interest out there for Apple Intelligence.\nCarrying on in the quarter, we are looking forward to bringing even more features in December, and this will include even more powerful writing tools and visual intelligence experience that builds on Apple Intelligence and ChatGPT integration in addition to other features as well as we'll bring localized English to several countries that include the U.K., Australia, and Canada. So, it's going to be quite a software quarter between the release on Monday and the release in December. And then as we turn the corner to '25, we'll have more languages rolling out in -- starting in April as well and more features as well. And so, it's a very, very strong drumbeat, and we couldn't be more excited about it.\nMichael Ng -- Goldman Sachs -- Analyst\nGreat. Thank you very much. And my second one, just for Luca. First, congratulations again, Luca, on the new role, and it's been a real privilege of being able to spend some time with you.\nA question that, I think, will overlap with your new role as well. Could you just talk a little bit about the capex outlook and whether investments in things like private cloud compute could change the historical capex range of roughly $10 billion a year? Thank you very much.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nThank you, Michael. On the capex front, I mentioned before a number of times, we have a bit of a hybrid model in the way we run our data centers. In some cases, we use our own data centers. In some cases, we use third-party providers.\nSo, our capex numbers may not be fully comparable with others. But obviously, we are rolling out these features, Apple Intelligence features already now. And so, we are making all the capacity that is needed available for these features. You will see in our 10-K the amount of capex that we've incurred during the course of fiscal '24.\nAnd we will -- in fiscal '25, we will continue to make all the investments that are necessary, and of course, the investments in AI-related capex will be made.\nMichael Ng -- Goldman Sachs -- Analyst\nGreat. Thank you, Tim. Thank you, Luca.\nSuhasini Chandramouli -- Director, Investor Relations\nAll right. Thanks, Mike. Can we have the next question, please?\nOperator\nOur next question is from Erik Woodring with Morgan Stanley. Please go ahead.\nErik Woodring -- Analyst\nGreat. Thanks so much for taking my questions. I have two as well. Tim, maybe if we start with you, I think each of the last four years, you've exited the December quarter with iPhone demand outpacing supply.\nAs we look to this quarter in the iPhone 16 cycle, lead times are relatively short. There are no known supply shortages. And I'm just curious whether you've been able to maybe get a better read on early cycle iPhone demand this year relative to past years and if so, what you've learned about upgrade rates, switching rates, trade-ups versus trading down, and being more price sensitive. And overall, any impact that Apple Intelligence may have on iPhone 16 sales? And then I have a follow-up.\nThank you.\nTimothy Donald Cook -- Chief Executive Officer\nThere's a lot there. On Apple Intelligence, we believe it's a compelling upgrade reason. And we'll -- but we just launched it three days ago, and so what we've got now from a data point of view is the number I just referenced that 18.1 has twice the adoption rate of 17.1. So, that clearly shows a level of interest out there.\nIn terms of exiting the December quarter with demand greater than supply, that's not my recollection that that happened for all four of the years. We clearly had cases during COVID where there were disruptions, and that's -- some spilled over. But in a more regular environment where we're not having something, a 100-year flood kind of thing, we would -- our desire is to get into balance as quickly as possible. We don't want customers having to wait for products.\nAnd so, if you look at how we've done this year, we did that very quickly on the 16, on the 16 Pro family, the Pro and the Pro Max. We've been constrained in October, but we believe that soon we'll be out of constraint. And so, that's a good sign from our point of view. Keep in mind that that's a function of supply and demand, not one side or the other.\nAnd we've been preparing for the quarter for a while. So, that's what I would say there.\nErik Woodring -- Analyst\nOK. That's really helpful. Thank you, Tim. And then, Luca, if I just turn to you, obviously, it's been a pleasure working with you, and we wish you all the best in the next role.\nThere's plenty of debate in the market right now about input cost and commodity prices and the impact that will have on gross margins. Historically, you do guide gross margins up 50 basis points sequentially, which you just told us about for the December quarter. So, can you maybe just help us understand your view of component prices and broadly whether you still see those as tailwinds to gross margins and how sustainable that tailwind might be or whether that should become a headwind as we look forward? Thanks so much.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nYes, Erik. As you know, our gross margins are a factor of many, many variables. Commodities, of course, are important. They're not the only factor.\nBut specifically on commodities, I can tell you that both for the September quarter and what we expect for the December quarter, most commodities are going to move down in price while NAND and DRAM increased during the course of the September quarter, and we expect them to increase during the December quarter. We are very pleased with the level of gross margins that we've reported during the course of the year, the entire fiscal year of '24. They are really, for our company, record levels of gross margin and obviously guiding to 46% to 47% for the December quarter with all the new technologies that we've included in the products, with all the new features that Tim has talked about a lot of new products across the board. I think it's a very good sign.\nErik Woodring -- Analyst\nGreat. Thanks so much, Luca.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nThank you. Erik.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you very much. Can we have the next question, please?\nOperator\nOur next question is from Ben Reitzes from Melius. Please go ahead.\nBen Reitzes -- Melius Research -- Analyst\nHey, thanks a lot. And I'll echo those comments about Luca. We'll miss you and good luck. And my question is with regard to iPhone again.\nAnd with regard to the fourth quarter is my first question -- or sorry, the fourth calendar quarter, your first quarter. When you look at mid- to low single-digit revenue growth, do you expect the iPhone to grow faster? And what are you thinking about in the answer to that question with regard to China, which keeps improving each quarter? And then I have just a follow-up. Thanks.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nYeah. You know, Ben, we are not providing that level of color today. Yes, we've said that we expect total company revenue to grow low to mid-single digits. Keep in mind, Apple Intelligence, as Tim said, is rolling out over time, both features and languages.\nAnd we just had a number of exciting launches just this week from the Apple Intelligence feature to the new Mac. So, we'll leave it at that. We've given you the total for the company and some pretty good direction on services, which we expect to continue to grow at a similar rate than what we've seen in fiscal '24.\nBen Reitzes -- Melius Research -- Analyst\nWell, great. Thanks, Luca. Hey, Tim, I wanted to ask you, I mean -- and you guys are well aware, a lot of the noise out there, people chattering about builds, lead times. And you guys are guiding for mid- to low single-digit growth.\nThat certainly doesn't sound like alarm bells here vis-a-vis what you guys must be hearing. And I know you guys are just running your business and doing the best you can. But you have a lot of perspective now, Tim. What are people missing here? And it certainly just sounds like you guys are typically conservative.\nThat guide for revenue is -- certainly sounds like the sky is certainly not falling and you have a pretty good product cycle. So, what do you think people are missing? And what are you excited about? Thanks so much, Tim.\nTimothy Donald Cook -- Chief Executive Officer\nBen, I could not be more excited about Apple Intelligence and the rollout that we've got in front of us. I'm on the -- I'm obviously on future releases as well -- working on and it's changing my daily life. I'm super excited about the health features that we're rolling out. If -- the number of emails I'm already getting from customers that have taken the hearing test and are using their AirPods Pro 2 as a hearing aid are just -- are staggering and heartwarming to read.\nI'm also thrilled about sleep apnea and the notification there that we'll have through the Watch. This week is a very exciting week for us because we just rolled out three days, three launches of different Macs and desktops, and laptops. And so, we have a lot of things on the docket and it's definitely the strongest lineup we've ever had going into the holiday season. In terms of the noise, I tune it out because if not, it would just be deafening.\nAnd so, that's what I do. I can't speak for everybody else, but that's what I do.\nBen Reitzes -- Melius Research -- Analyst\nThanks a lot, Tim. Appreciate it.\nTimothy Donald Cook -- Chief Executive Officer\nThanks, Ben.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you, Ben. Can we have the next question, please?\nOperator\nOur next question is from Amit Daryanani with Evercore. Please go ahead.\nAmit Daryanani -- Analyst\nYep. Good afternoon. Thanks for taking my questions. I have two as well.\nLuca, best of luck in the future. It's been a pleasure working with you. I guess the first one I have is away from my iPhone. On the Services side, you're adding $100 billion run rate with services today, which is a phenomenal achievement by itself.\nAs you look at the Services portfolio today, can you just talk about how much of this business do you think is reoccurring versus transactional? And are the growth rates different between the subscription portfolio over here versus transactional portfolio?\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nYes, Amit. I'll take this one. Yes, we are, first of all, very, very happy with -- it's an important milestone. Of course, we've got to a run rate of $100 billion.\nYou look back just a few years ago, and the growth has been phenomenal. We're very pleased we've got a very diversified portfolio of services. And over the years, the amount that is recurring in nature has grown and it's growing faster than the transactional piece. We have well over 1 billion paid subscriptions on our platform right now between our own services and third-party services.\nThat continues to grow strong double digits. So, we feel very, very good. And essentially, to your question, yes, the recurring portion is growing faster than the transactional one.\nAmit Daryanani -- Analyst\nGot it. And if I can just follow up, if I look at the growth rates across the different geographies, there's always concern around China when it comes to iPhone demand, I feel, but the performance in September looks fairly good. Just wondering if you could just touch on what are you seeing from a demand perspective in China if the recent stimulus plans in China could essentially be a catalyst for iPhones. And then EMEA really stood out with double-digit growth.\nMaybe you can just flesh that out as well for us. Thank you.\nTimothy Donald Cook -- Chief Executive Officer\nYeah. I'll take the China question. If you look at how we did for the quarter, we were relatively flat year over year. And a key component of that improvement relative to the year-over-year performance that we had been achieving is that there was a sequential improvement in foreign exchange, and so that helped us out.\nAs you know, it's been a headwind that we've been reporting for a period of time. But the other parts that are -- what else is going on there is that our installed base of active devices reached an all-time high. We had the top two selling smartphones in urban China according to Kantar. The level of new customers that we have buying the products like Mac and iPad are well over 50%.\nWatch is over three-quarters that are new to the product. And so, there's several positive signs there. In terms of the stimulus, it's a clear focus of the team there. But I'm not an economist and don't want to ad lib on the effect of it.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nOn the Europe side, I mean, a number of things. As you see from our results during the quarter, Europe grew double digits, 11%. And really, it was really good growth across the board. The different segments, they all did well.\nKeep in mind our definition of Europe in our segment reporting includes a number of emerging markets like Turkey, where we've grown very strongly, the Middle East. Tim mentioned a number of records in Saudi, in UAE. And we also include India, where we set an all-time revenue record during the September quarter. But I have to say, also Western Europe grew nicely.\nSo, we've seen very, very good results for us in the entire segment.\nAmit Daryanani -- Analyst\nGreat. Thank you very much.\nSuhasini Chandramouli -- Director, Investor Relations\nThanks, Amit. Can we have the next question, please?\nOperator\nOur next question is from David Vogt both with UBS. Please go ahead.\nDavid Vogt -- UBS -- Analyst\nGreat. Thanks, everyone for taking my questions. And congratulations, Luca. I know, Luca, and I know, Tim, you don't want to give a lot of granularity.\nBut if I just try to pull together your comments about what the demand environment looks like, are we to assume, based on sort of the commentary, that there is a risk that maybe the product revenue portfolio could be down in the December quarter, if I take your numbers at face value? And if that's the risk, is that more iPhone-related, Mac-related given the strength that you've seen in iPad-related? Just trying to get a handle on kind of what potentially is giving you that degree of, I don't want to say caution but maybe balanced for you going into the December quarter. And then I have a follow-up.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nAs I said, David, we're not providing that level of color. We've given you some data on services. I would repeat what I said earlier. We're very early in the cycle, very early in the cycle with a lot of new products and features that we are launching.\nAnd we're very excited about them, but it's early. And the Apple Intelligence rollout is going to happen over time, not across the world as normally we do with software releases.\nDavid Vogt -- UBS -- Analyst\nRight. OK. So, maybe a follow-up for Tim. When you think about, to Luca's point, about the rollout being staged over the next several quarters across the world, do you think that has any impact on sort of the normal historical demand cadence across different regions? So, should we see something different, let's say, in the December quarter, the March quarter, or the June quarter, etc., relative to history given the timing of the rollout and where customers are probably waiting for the devices to be enabled to have the operating system? Would just love to kind of get your perspective on how we think about the demand cadence, how it might be different than maybe historically.\nThank you.\nTimothy Donald Cook -- Chief Executive Officer\nYeah, David. It's clearly, as you point out, a different cadence, if you will, than we would normally do. And we -- as we talked about at WWDC, we wanted to give a comprehensive vision of Apple Intelligence, and we said then that it would roll out over time, and we're right on the -- what we said at WWDC. And so, we're executing well.\nIn terms of the demand curve, I would just say that what we believe here is that it's a compelling reason for upgrading. And it's -- that's both my personal experience and feedback that I'm getting. And so, we'll see. We're not projecting beyond the current quarter obviously.\nWe just don't do that.\nDavid Vogt -- UBS -- Analyst\nGreat. Thanks, Tim, and best of luck, Luca.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nThank you very much.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you. David. We'll take the next question, please.\nOperator\nOur next question is from Wamsi Mohan with Bank of America. Please go ahead.\nWamsi Mohan -- Analyst\nYes. Thank you so much. Luca, we will miss you on these calls. Tim, maybe for you, as you think about this staggered rollout of Apple Intelligence, can you help us think through potentially how much of the global installed base of phones will have access to Apple Intelligence in their native language, in their region within the next year or maybe in the next two years? And what are some of the gating factors in the rollout? And I have a follow-up.\nTimothy Donald Cook -- Chief Executive Officer\nIf you look at our schedule, we started in the -- with U.S. English. That started on Monday. There's another release coming that adds additional features that I had referenced in December in not only U.S.\nEnglish but also localized for U.K., Australia, Canada, Ireland, and New Zealand. And then we will add more languages in April. We haven't set the specifics yet in terms of the languages, but we'll add more in April and then more as we step through the year. And so, we're moving just as fast as possible while ensuring quality.\nThat's what we're doing.\nWamsi Mohan -- Analyst\nOK. Thanks, Tim. And then as a follow-up, maybe this is a little premature. But how is Apple, at a high level, prepared to potentially deal with any tariffs that might come post this election cycle? And if not exactly, help -- perhaps you can just help investors think about some of the things Apple has done already to try to insulate from some of these impacts -- potential impacts?\nTimothy Donald Cook -- Chief Executive Officer\nYou know, I wouldn't want to speculate about those sorts of things, and so I'm going to punt on that one.\nWamsi Mohan -- Analyst\nOK. Thank you, Tim.\nTimothy Donald Cook -- Chief Executive Officer\nYep. Thank you.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you, Wamsi. May we have the next question, please?\nOperator\nOur next question is from Krish Sankar from TD Cowen. Please go ahead.\nKrish Sankar -- Analyst\nYeah. Hi. Thanks for taking my question. And again, thanks, Luca, for all your help with analysts and investors.\nMy first question is on R&D. Given how much your tech peers are spending on AI, does this new era of Apple Intelligence actually require Apple to invest more in R&D beyond your current 7% to 8% of sales to capture this opportunity? And then I had a follow-up.\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nKrish, as you know, we've been investing heavily in R&D over the last several years. Our R&D growth has been significant during the last several years. And obviously, as we move through the course of fiscal '24, we've also reallocated some of the existing resources to this new technology, to AI. And so, the level of intensity that we're putting into AI has increased a lot, and you maybe don't see the full extent of it because we've also had some internal reallocation of the base of engineering resources that we have within the company.\nKrish Sankar -- Analyst\nGot it. Got it. Thanks for that. And then another quick follow-up.\nI understand Apple Intelligence is a feature on the phone today. But do you think that in the future it could potentially have or benefit the services growth business? Or is that too -- are those too bifurcated to even make a call on the -- this early in the cycle? Thank you.\nTimothy Donald Cook -- Chief Executive Officer\nI think just to keep it in mind, Apple Intelligence is also available on the Mac for the M Series products and on certain models of iPad and in addition to the phone. And so, it's on all three. Your -- what was your follow-on question?\nKrish Sankar -- Analyst\nTwo of those. One, can the Apple Intelligence actually help? And how the services growth rate --\nTimothy Donald Cook -- Chief Executive Officer\nKeep in mind that we have released a lot of APIs, and developers will be taking advantage of those APIs. That release has occurred as well, and of course, more are coming. And so, I definitely believe that a lot of developers will be taking advantage of Apple Intelligence in a big way. And what that does to services, I'll not forecast, but I would say that from an ecosystem point of view, I think it will be great for the user and the user experience.\nKrish Sankar -- Analyst\nGot it. Thanks, Tim.\nTimothy Donald Cook -- Chief Executive Officer\nYeah.\nSuhasini Chandramouli -- Director, Investor Relations\nAll right. Thank you, Krish. Can we have the next question, please?\nOperator\nOur next question comes from Samik Chatterjee with JPMorgan. Please go ahead.\nSamik Chatterjee -- Analyst\nGreat. Thank you. Thanks for taking my questions. And Luca, congrats on the new role, and a pleasure working with you these years.\nI guess if I can, for my first one, start with mix on the iPhone side and what I'm really curious about, if you have any thoughts given that Apple Intelligence is now going to be a consistent feature set across all the four sort of iPhones on the iPhone 16 series that you launched and going back to iPhone 15 Pro and Pro Max. Are you seeing any change in behavior from a consumer perspective in terms of which -- sort of on the mix front within the iPhone series where consumer adoption is given that there's more consistency of the features when it comes to Apple Intelligence across the board? And I have a follow-up. Thank you.\nTimothy Donald Cook -- Chief Executive Officer\nIt's tough to answer your question because we've been constrained in October on the Pro and the Pro Max. And so, it's really too early in the curve to call the precise mix on the consumer versus the Pro. So, we'll see.\nSamik Chatterjee -- Analyst\nOK. OK. And for my follow-up, Tim, during the quarter or, I think, over the last 90 days, we had the quotes come out in relation to the DOJ relative to the Google sort of revenue-sharing agreement that you have with them. How do you sort of look at it going forward in terms of emphasizing the role that Apple has in that ecosystem with Safari and sort of the potential outcome that you're looking at? Thank you.\nTimothy Donald Cook -- Chief Executive Officer\nYou know, I don't want to speculate on that from a legal point of view. It's an ongoing case. And I will save that for another day.\nSamik Chatterjee -- Analyst\nOK. No, thank you. I'll leave it there. Thank you.\nTimothy Donald Cook -- Chief Executive Officer\nYeah.\nSuhasini Chandramouli -- Director, Investor Relations\nAll right. Thank you so much. Operator, may we have the next question, please?\nOperator\nOur next question comes from Richard Kramer with Arete Research. Please go ahead.\nRichard Kramer -- Arete Research -- Analyst\nThanks very much. First one, Tim, I'd like to ask about some of the components of services where despite your installed base, some parts of the Apple One bundle, like Music and News and Arcade and Fitness are not obviously the market-leading offerings. And maybe what might change that? And what other services could you call out as growing faster, having wider or widening addressable markets like we've seen in Pay or advertising?\nTimothy Donald Cook -- Chief Executive Officer\nThe way that I view it is that we have lots of opportunity in all of those, and so there's lots of customers to try to convince to take advantage of it, and we're going to continue investing in the services and adding new features and whether it's News+ or Music or Arcade, that's what we're going to do. Keep in mind that, for us, we're more focused on being best than being most, and so in some cases, not in every case, some of the services that you -- the majority of the services that you mentioned are not cross-platform. We make them for our customers only. And so, that, in some cases, changes the person who's going to sell the most perhaps.\nBut that's -- our objective is to make the best.\nRichard Kramer -- Arete Research -- Analyst\nOK. Thanks. And then, Luca, one piece of unfinished business was your pledge to get to a net neutral cash position. And over the last two years, you stayed around $50 billion of net cash.\nWe've clearly seen instances in the past where elevated marketing spend or other programs brought increases in market share. I guess my question looking back on your tenure is at your scale now with $57 billion of opex, do you still see incremental ways to put that cash to work in the business? Or will we just continue to see increased shareholder returns?\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nWell, obviously, as you've seen, our opex has gone up over the years. We've also seen, at the same time, a significant expansion in gross margin, maybe to a level that I would have not expected a few years ago, but we've done a very good job on a number of fronts. And so, I would say we -- when we plan -- every time we plan for the upcoming year, we think about all the different areas where we can deploy our resources, and we make them available to grow the business. I think we've done very well over the long term.\nBut our fundamental philosophy is to look after the business first. And then if we have excess cash, we will continue to return it to our shareholders, and the plan has worked quite well so far.\nRichard Kramer -- Arete Research -- Analyst\nOK. Thank you very much.\nSuhasini Chandramouli -- Director, Investor Relations\nThank you, Richard. We'll take our last question, please, operator.\nOperator\nOur last question comes from Atif Malik with Citi. Please go ahead.\nAtif Malik -- Analyst\nThank you for squeezing me in. It seems to us that the spec differentiation between iPhone 16 Pro and base models isn't as big as prior years. All iPhones have new A18, 18 Pro chips, and there wasn't an increase in ASPs versus last year. Can you share with us if there is a shift in your strategy in terms of [Technical difficulty]\nOperator\nUnfortunately, Mr. Malik's line has dropped.\nSuhasini Chandramouli -- Director, Investor Relations\nAll right. Sorry, Atif, we'll connect offline. Thank you, everybody. A replay of today's call will be available for two weeks on Apple Podcasts, as a webcast on apple.com/investor, and via telephone.\nThe number for the telephone replay is 866-583-1035. Please enter confirmation code 0331536 followed by the pound sign. These replays will be available by approximately 5 p.m. Pacific today.\nMembers of the press with additional questions can contact Josh Rosenstock at 408-862-1142. And financial analysts can contact me, Suhasini Chandramouli, with additional questions at 408-974-3123. Thank you again for joining us.\nOperator\n[Operator signoff]\nDuration: 0 minutes\nCall participants:\nSuhasini Chandramouli -- Director, Investor Relations\nTimothy Donald Cook -- Chief Executive Officer\nLuca Maestri -- Senior Vice President, Chief Financial Officer\nMichael Ng -- Goldman Sachs -- Analyst\nTim Cook -- Chief Executive Officer\nErik Woodring -- Analyst\nBen Reitzes -- Melius Research -- Analyst\nAmit Daryanani -- Analyst\nDavid Vogt -- UBS -- Analyst\nWamsi Mohan -- Analyst\nKrish Sankar -- Analyst\nSamik Chatterjee -- Analyst\nRichard Kramer -- Arete Research -- Analyst\nAtif Malik -- Analyst",
    "word_count": 8388,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple sales rise 6%, company seeing early iPhone 16 demand",
    "summary": "",
    "url": "https://www.cnbc.com/2024/10/31/apple-aapl-q4-earnings-report-2024.html",
    "source": "",
    "original_score": 0.7424217,
    "custom_score": 0.22272651,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:19:39.613216",
    "full_content": "Apple's fiscal fourth-quarter results beat Wall Street expectations for revenue and earnings per share, but net income slumped after the company paid a one-time charge as part of a tax decision in Europe.\nApple shares were down 2% on Friday.\nHere's how the iPhone maker did versus LSEG consensus estimates for the quarter ending Sept. 28:\n- Earnings per share: $1.64, adjusted, versus $1.60 estimated\n- Revenue: $94.93 billion vs. $94.58 billion estimated\n- iPhone revenue: $46.22 billion vs. $45.47 billion estimated\n- Mac revenue: $7.74 billion vs. $7.82 billion estimated\n- iPad revenue: $6.95 billion vs. $7.09 billion estimated\n- Other Products revenue: $9.04 billion vs. $9.21 billion estimated\n- Services revenue: $24.97 billion vs. $25.28 billion estimated\n- Gross margin: 46.2% vs. 46.0% estimated\nOverall iPhone revenue grew 6%, in the first sign of how the iPhone 16 is faring in the market. Apple's newest devices came out Sept. 20, giving Apple about a week of new product sales in the quarter. It's still Apple's most important product, accounting for nearly 49% of the company's overall sales.\nSales of the iPhone 15 were \"stronger than 14 in the year-ago quarter, and 16 was stronger than 15,\" Apple CEO Tim Cook told CNBC's Steve Kovach.\nCook said the company was looking forward to Apple Intelligence, the AI system for iPhones and Macs that started to roll out this week as part of the iOS 18.1 update.\n\"We're getting great feedback from customers and developers already and a really early stat, which is only three days worth of data: Users are adopting iOS 18.1 at twice the rate that they adopted 17.1 in the year-ago quarter,\" Cook said.\nApple said on a call with analysts that it expects \"low to mid-single digit\" sales growth during the December quarter. It also signaled that it expects services growth to be about the same as its growth rate for the past year, which was 12.87%.\nApple reported $14.73 billion, or 97 cents per share, in net income during the quarter, versus $22.96 billion, or $1.47 per share, in the year-ago period. Apple's adjusted earnings per share, after removing the one-time tax charge, increased 12% on an annual basis.\nRevenue rose about 2% for the full fiscal year to $391.04 billion. Revenue in the September period was up 6%. The company's cash pile now stands at $156.65 billion.\nDuring the quarter, Apple paid a one-time income tax charge of $10.2 billion to resolve a long-running case dating back to 2016 over how the company handled taxes in Ireland.\nApple's results close out a busy week of earnings for the top tech companies. Alphabet on Tuesday reported better-than-expected results, driven by cloud growth. Microsoft issued disappointing guidance on Wednesday, leading to the stock's steepest sell-off in two years, while Meta beat estimates but warned of significant acceleration in its infrastructure expenses next year. On Thursday, Amazon reported strong growth in its cloud business.\nApple's iPad business had the strongest growth of any of hardware line, with an 8% increase in sales to $6.95 billion. That was partly from pent-up demand. Apple released new iPad Pro and Air models in May after going through all of 2023 without releasing new iPads.\nRevenue in the Mac business rose 2% on an annual basis to $7.74 billion during the quarter, which included back-to-school laptop sales. Cook told CNBC that the growth was driven by sales of the MacBook Air, which was updated with new chips in the spring.\nApple's services business — which includes online subscriptions such as iCloud, Google search revenue, and AppleCare warranties for Apple hardware — grew 12% on an annual basis to nearly $25 billion in sales. However, Apple's services revenue came in under LSEG consensus expectations.\nThe company reports its AirPods headphones, Homepod speakers and Apple Watch sales in a category it calls Other Products or wearables. That unit came in light versus revenue forecasts of $9.04 billion, which was down 3% year over year. The company released new Apple Watch and AirPods models during the quarter alongside the new iPhones.\nApple's results in China, the company's third-largest region, are closely watched by investors. The company faces renewed competition from local Chinese handset makers such as Huawei. Apple's revenue in China, Taiwan, and Hong Kong was down slightly year over year at $15.03 billion.\nThe company said it spent $29 billion on share repurchases and dividends during the quarter.\nWATCH: Apple Intelligence rollout could be an inflection point, says Futurum Group CEO Daniel Newman",
    "word_count": 751,
    "extraction_method": "handle_default"
  },
  {
    "title": "Why Apple Stock Is Slipping on Earnings - Barron's",
    "summary": "",
    "url": "https://www.barrons.com/livecoverage/apple-earnings-stock-price-iphone-sales",
    "source": "",
    "original_score": 0.63193506,
    "custom_score": 0.489580518,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:19:40.200670",
    "full_content": "LIVE UPDATES | CONCLUDED\nWhy Apple Stock Is Slipping on Earnings\nFollow live coverage of the iPhone maker's fourth-quarter results.\nLast Updated:\nNov. 4, 2024 at 4:48 AM EST\nKey Events\n21 days ago\nPinned Post\nApple shares were slipping in late trading Thursday after the company posted adjusted earnings of $1.64 a share, slightly ahead of Wall Street's $1.60 per share estimate.\nRevenue for the September quarter was $94.9 billion, up 6% from a year ago. Analysts had forecast sales of $94.52 billion.\nFor the same fiscal fourth quarter, iPhone revenue was $46.22 billion versus the $45.16 billion FactSet estimate. The iPad generated $6.95 billion in revenue versus a $7.09 billion consensus, while the Mac segment was $7.74 billion versus a $7.86 billion estimate.\nShares were initially down 1.5% in after-hours trading following the report.",
    "word_count": 136,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple (AAPL) earnings report Q2 2024 - CNBC",
    "summary": "",
    "url": "https://www.cnbc.com/2024/05/02/apple-aapl-earnings-report-q2-2024.html",
    "source": "",
    "original_score": 0.69771194,
    "custom_score": 0.509313582,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:20:24.723641",
    "full_content": "Apple shares climbed 7% in extended trading on Thursday after the iPhone maker reported fiscal second-quarter earnings that topped estimates and announced an expanded stock buyback program.\nApple announced that its board had authorized $110 billion in share repurchases, a 22% increase over last year's $90 billion authorization. It's the largest buyback in history, ahead of Apple's previous repurchases, according to data from Birinyi Associates.\nHowever, overall sales fell 4% and iPhone sales fell 10% year over year during the quarter, which Apple attributed to a tough comparison versus last year.\nHere's how Apple did versus LSEG consensus estimates in the quarter ended March 30:\n- EPS: $1.53 vs. $1.50 estimated\n- Revenue: $90.75 billion vs. $90.01 billion estimated\n- iPhone revenue: $45.96 billion vs. $46.00 billion estimated\n- Mac revenue: $7.5 billion vs. $6.86 billion estimated\n- iPad revenue: $5.6 billion vs. $5.91billion estimated\n- Other Products revenue: $7.9 billion vs. $8.08 billion estimated\n- Services revenue: $23.9 billion vs. $23.27 billion estimated\n- Gross margin: 46.6% vs. 46.6% estimated\nApple did not provide formal guidance, but Apple CEO Tim Cook told CNBC's Steve Kovach that overall sales would grow in the \"low single digits\" during the June quarter.\nApple posted $81.8 billion in revenue during the year-ago June quarter and LSEG analysts were looking for a forecast of $83.23 billion.\nOn an earnings call with analysts, Apple finance chief Luca Maestri said the company expected the current quarter will deliver double-digit year-over-year percentage growth in iPad sales. What's more, he said the Services division is forecast to continue growing at about the current high rate it's achieved during the past two quarters.\nApple reported net income of $23.64 billion, or $1.53 per share, down 2% from $24.16 billion, or $1.52 per share, in the year-earlier period.\nCook told CNBC that sales in the fiscal second quarter suffered from a difficult comparison to the year-earlier period, when the company realized $5 billion in delayed iPhone 14 sales from Covid-based supply issues.\n\"If you remove that $5 billion from last year's results, we would have grown this quarter on a year-over-year basis,\" Cook said. \"And so that's how we look at it internally from how the company is performing.\"\nApple said iPhone sales fell nearly 10% to $45.96 billion, suggesting weak demand for the current generation of smartphones, which were released in September. The sales were in line with analyst estimates, and Cook said that without last year's increased sales, iPhone revenue would have been flat.\nMac sales were up 4% to $7.45 billion, but they are still below the segment's high-water mark set in 2022. Cook said sales were driven by the company's new MacBook Air models which were released with an upgraded M3 chip in March.\nOther Products, which is how Apple reports sales of its Apple Watch and AirPods headphones, was down 10% year over year to $7.9 billion.\nDuring the quarter, Apple released its first new major product category in years, the Vision Pro virtual reality headset, but the $3,500 device is expected to sell in low quantities, especially compared to Apple's major product lines.\n\"We're only scratching the surface there so we couldn't be more excited about our opportunity there,\" Cook said.\nApple has not released a new iPad since 2022, which is a drag on sales. Revenue for the division fell 17% to $5.6 billion. Apple is expected to announce new iPads on May 7 that could revive demand for the product line.\nCook said that Apple has \"big plans to announce\" at its iPad product event next week and at the Worldwide Developers Conference in June.\nThe company's Services business was a bright spot during the quarter. Sales rose 14.2% to $23.9 billion. That's how Apple reports revenue from its subscription services, warranties, licensing deals with search engines, and payments. The company has a broad definition of subscribers, including users subscribing to apps through Apple's App Store. It counts over 1 billion paid subscriptions.\nSales in Greater China, Apple's third largest region, were off 8% to $16.37 billion in revenue, which was significantly better than the $15.25 billion in sales expected by FactSet analysts, potentially quelling investor worries the iPhone maker may have been losing market share to local competitors such as Huawei.\n\"I feel good about China. I think more about long term than to the next week or so,\" Cook said.\nCook told CNBC that iPhone sales grew in China during the quarter, which \"may come as a surprise to some people.\"\nIn addition to the buyback authorization, Apple said it would pay a 25-cent dividend, a 1-cent increase.\nCorrection: Cook said that Apple has \"big plans to announce\" at its iPad product event next week and at the Worldwide Developers Conference in June. An earlier version misstated the context of the plans.",
    "word_count": 802,
    "extraction_method": "handle_default"
  },
  {
    "title": "Prediction: Apple Stock Will Be Below $200 by the End of the Year",
    "summary": "",
    "url": "https://www.fool.com/investing/2024/10/23/prediction-apple-stock-will-be-below-200-by-the-en/",
    "source": "",
    "original_score": 0.41964793,
    "custom_score": 0.125894379,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:20:49.889392",
    "full_content": "Apple (AAPL 0.59%) stock is currently trading around $230, but I think it's trading on borrowed time. By the end of the year, I wouldn't be surprised if the stock was below $200, because the fundamentals don't support Apple's current stock price.\nThere is a lot of pressure on Apple's business, and unless something drastic changes, the stock is due for a correction.\nApple's revenue peaked in 2022 and hasn't grown since\nApple's business needs no introduction. Its devices are in the hands of millions (if not billions) of people, although Apple seems to have hit a peak in its revenue. Since 2022, Apple's revenue hasn't increased any.\nCompanies need growth to sustain an increasing stock price, and Apple hasn't shown that. We'll find out more about Apple's latest results when it reports on Halloween night (a scary time to report earnings!), but early indications aren't great.\nApple released the iPhone 16 during the quarter, and multiple reports have indicated that sales of the iPhone 16 aren't what the company expected. Since iPhone sales make up about half of Apple's total revenue, this segment must do well for the rest of the business to thrive. This reported weakness has caused Wall Street analysts to tweak their expectations for the upcoming quarter, as the consensus earnings per share (EPS) projection has declined from $1.60 30 days ago to $1.55 now.\nFalling projections heading into earnings are never a good sign. If the rest of Apple's results aren't great, don't be surprised if the stock takes a hit, as it's trading at an incredibly pricey valuation.\nApple's stock fetches a massive premium despite lackluster results\nApple's stock fetches a far greater premium than most investors realize. At 35 times trailing earnings and 31 times forward earnings, Apple's stock is very expensive.\nWhile other stocks are trading at more expensive valuations, those companies are posting impressive growth numbers.\nOver the long haul, stock price movements are heavily correlated to earnings growth. So, when a benchmark index like the S&P 500 (^GSPC 0.35%) averages a 10% return per year, that's the level of earnings growth a company typically needs to beat the market consistently, if the two securities trade at the same valuation.\nLast quarter, Apple's earnings per share (EPS) grew at a 10% pace. In fourth-quarter fiscal year 2024 (ending around Sept. 30), analysts expect 14% growth. Both figures are either right at the S&P 500's long-term average or slightly higher. However, with the S&P 500 trading at 24.7 times trailing earnings and 23.8 times forward earnings, Apple holds a 43% and 32% premium to those respective valuation metrics.\nBest-in-class businesses often get a premium valuation due to their execution and perceived steadiness, which Apple absolutely qualifies for. The question is, how much is that worth? I can't decide that for the market or you, but for me, the current premium Apple gets is far too high.\nThere are way too many stocks I can buy right now that trade at far cheaper valuations that are growing faster than Apple. Buying these stocks instead of Apple will likely boost my long-term returns, so they make for much better buys.\nIn the meantime, if Apple doesn't report great Q4 results, its stock could sink below the $200 mark, as its current price tag means the company must execute to perfection. Early indications are that it hasn't, and that could be the catalyst the stock needs to send it tumbling.",
    "word_count": 575,
    "extraction_method": "handle_default"
  },
  {
    "title": "JPMorgan in talks with Apple to take over its credit card venture: report",
    "summary": "",
    "url": "https://www.marketwatch.com/story/jpmorgan-in-talks-with-apple-to-take-over-its-credit-card-venture-report-7844a984",
    "source": "",
    "original_score": 0.54788744,
    "custom_score": 0.164366232,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:21:29.164708",
    "full_content": "JPMorgan in talks with Apple to take over its credit card venture: report - MarketWatch\n✕\nSEARCH\nAdvanced Search\n➔\nSearch Results\nSymbols\nNo results found\nPrivate Companies\nNo results found\nRecently Viewed Tickers\nAll News\nArticles\nVideo\nPodcasts\nNo Results Found\nAuthors\nNo results found\nSections\nNo results found\nColumns\nNo results found\nJPMorgan in talks with Apple to take over its credit card venture: report\nPublished:\nSept. 18, 2024 at 5:52 a.m. ET\nApple may be planning deeper involvement in the world of payments beyond the credit card it has in partnership with Goldman Sachs. JPMorgan is in talks with Apple to take over its credit card venture.\nPhoto:\nApple\nJPMorgan Chase is reportedly in talks with Apple to take over its fast-growing credit card venture after the technology giant made a push to cut ties with its former partner Goldman Sachs last year.\nApple and JPMorgan’s talks started earlier this year, although there are no guarantees the two firms will reach a deal,\nthe Wall Street Journal reported\n, citing sources familiar with the matter.\nAbout the Author\nLouis Goss\nLouis Goss is a MarketWatch reporter based in London.\nShow Conversation\n(0)\nBack To Top\nCopyright ©\n2024\nMarketWatch, Inc. All rights reserved.\nTerms of Use\nUPDATED\nPrivacy Notice\nCookie Notice\nMarketWatch\nCustomer Center\nContact Us\nNewsroom Roster\nVirtual Stock Exchange\nMarketWatch Guides\nCopyright Policy\nManage Notifications\nCancel My Subscription\nCompany\nDow Jones\nCode of Conduct\nCorrections\nReprints & Licensing\nDigital Self Service\nYour Ad Choices\nCorporate Subscriptions\nAccessibility\nDow Jones Network\nThe Wall Street Journal\nBarron's\nInvestor's Business Daily\nBigCharts\nFinancial News London\nrealtor.com\nMansion Global\nDow Jones Smart Money\nIntraday Data provided by\nFACTSET\nand subject to\nterms of use.\nHistorical and current end-of-day data provided by\nFACTSET\n. All quotes are in local exchange time. Real-time last sale data for U.S. stock quotes reflect trades reported through Nasdaq only. Intraday data delayed at least 15 minutes or per exchange requirements.",
    "word_count": 326,
    "extraction_method": "handle_default"
  },
  {
    "title": "How Apple does M&A: Small and quiet, with no bankers - CNBC",
    "summary": "",
    "url": "https://www.cnbc.com/2021/05/01/how-apple-does-ma-small-and-quiet-with-no-bankers.html",
    "source": "",
    "original_score": 0.48956454,
    "custom_score": 0.146869362,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:21:30.715213",
    "full_content": "In February, Apple CEO Tim Cook told shareholders that the company had bought about 100 companies in the past six years. That works out to the iPhone maker buying a company every three to four weeks.\nThe statistic gives the impression of a dealmaking machine. But only a handful of those deals have been big splashy transactions like the $3 billion deal for headphone maker Beats Music in 2014. The vast majority have been for significantly smaller firms without a major public profile.\nWhile big tech rivals routinely strike multi-billion dollar deals, Apple has followed a different strategy. It's refined the \"acquihire,\" or strategic purchase of a small company primarily for its staff.\nPeople who have joined Apple through an acquisition and participated in the acquisition process told CNBC that Apple's acquisition strategy focuses on getting talented technical staff from smaller companies, often valuing those companies in terms of the number of engineers working there, and quickly and quietly integrating them into teams at Apple.\nApple has used acquihires to speed expansion in fields where it needs technical talent or it sees a specific technology that could set it apart from its rivals. While the acquihire is a common technique among big tech companies, Apple's near-exclusive focus on smaller transactions sets it apart.\n\"We have seen companies such as Google, Facebook, Intel and Amazon going for many billion-dollar deals,\" said Nicklas Nilsson, analyst at GlobalData, a firm that tracks M&A transactions. \"Apple is buying more smaller startups while others spend more on established players.\"\nCook said in an interview with CNBC in 2019 that the company's approach is to identify where the company has technical challenges and then to buy companies that address them. One example was the acquisition of AuthenTec in 2012, which led to the iPhone's fingerprint scanner. \"We bought a company that accelerated Touch ID at a point,\" Cook said.\nOther past acquisitions have become features in Apple products. In 2017, Apple bought an iPhone app for power users called Workflow, which is the basis for Shortcuts app. In 2018, it bought Texture, which reemerged as Apple News+, its subscription news service. Even Siri, its voice assistant, was the result of an 2010 acquisition.\nApple has gone on sprees picking up multiple firms in augmented and virtual reality, artificial intelligence, maps, health, and semiconductors, presaging future products or features.\nBuying technical staff\nMany of Apple's deals have flown under the radar. According to a CNBC analysis of public reports, Apple has purchased 55 companies since January 2015, in line with a congressional report from last year and significantly lower than Cook's own tally.\nPeople who have participated in Apple's acquisition process say Apple expects discretion -- unsurprising given how secretive the company is. Apple generally doesn't announce small acquisitions and warns staff at the acquired companies not to update LinkedIn profiles to say they were acquired by Apple. If a member of the media gets wind of a deal and asks, Apple sometimes confirms deals with a boilerplate phrase that it \"generally does not discuss\" its purpose or plans for acquired companies.\nOne person who sold a company to Apple said that after news of his deal broke, he could not respond to friends and family congratulating him. He asked not to be named because he is under non-disclosure agreements.\nWhile every deal is different in its specifics, there are a few commonalities to Apple's approach. Apple is generally not interested in continuing the acquired company's line of business, and forces acquired units to discontinue future products or shed customers. The revenue generated by smaller companies is usually immaterial and unimportant to Apple, which reported $274.52 billion in sales in its fiscal 2020.\nApple is particularly interested in technical staff, who are often called \"individual contributors\" in Silicon Valley jargon. It's less interested in hiring sales or support staff, according to people who have participated in the process. Apple has put conditions on transactions that a certain number of technical employees must join Apple or the deal would fall through.\nThese technical employees get what are called \"golden handcuffs,\" or large stock packages that vest over three or four years. Acquired staff also get paid for their equity in the company that was acquired. Some people familiar with Apple's process say that it assigns value to companies based on the number of technical employees, with a price tag of around $3 million per engineer, instead of basing it on the start-up's revenue or fundraising track record.\nNo bankers\nOften, Apple's acquisition process starts after a demo to technical teams at Apple. Apple frequently invites other companies to show technology that Apple might want to partner with or license, and sometimes these meetings kick off an acquisition process.\nWhen a manager on those teams decides they want the technology or talent, they bring it up to the M&A team, which acts as a service organization helping Apple's engineering groups close the transaction smoothly, a person familiar with the process said.\nOnce the transaction is completed, Apple has a team that focuses on integrating the new employees into the specific technical group where they'll contribute. Individual contributors who join Apple through an acquisition often stay past their first vesting cliff, meaning that their first large chunk of Apple stock has been granted to them, and can stay with the company for years, signaling an effective integration.\nFor smaller deals, Apple doesn't typically deploy bankers. Apple's M&A team does due diligence, interviews team members and keeps the transaction on track to close. One person who declined to be named because of NDAs said that Apple's team was unusually trustworthy and professional compared to other companies he had engaged in talks with, although they knew what they wanted to pay for the company when the process started, he said.\nA closer look at what Apple is buying can reveal where the company is expanding quickly. One field is in augmented and virtual reality technologies, where Apple has bought 12 companies since 2013 as it builds out the Technology Development Group (TDG) division, which is working on head-worn computers. Apple is working on a high-end VR headset for release in 2022 and more advanced, lightweight glasses in 2023 or later, according to reports.\nFor example, in 2018 Apple bought Akonia Holographics, which worked on smart glasses lenses. Last year, Apple bought NextVR, which wrangled content for virtual reality headsets, and Spaces, a spin-off out of DreamWorks Animation that built location-based virtual reality experiences.\nMore recently, Apple has been snapping up firms working on artificial intelligence, buying 25 companies in the space since 2016, according to GlobalData.\nSkilled workers in AI can be difficult to hire because many companies want them. Apple is also working to improve its Siri voice assistant to compete with Amazon's Alexa and Google's assistant.\nLast year, Apple bought a Seattle-based firm called Xnor.ai for a reported $200 million. It followed that up by buying Ireland's Voysis, which worked on understanding speech. In 2019, it bought Pullstring, which made tools to build talking toys like Barbie.\nApple could certainly go for bigger game with more than $200 billion of cash and liquid investments and over $80 billion in annual free cash flow. Wall Street bankers have encouraged a big purchase in the past, and Apple did spend $1 billion to buy Intel's wireless modem business, including 2,200 employees, in 2019. That year, Apple promoted its head of M&A, Adrian Perica, to its executive team reporting to Cook. Still, Apple has been judicious, leading many financiers to believe that a big acquisition is not part of the company's DNA.\n\"We're not afraid to look at acquisitions of any size. But our priority is on valuation and strategic fit, and our focus is generally going to be on small, innovative companies exploring technologies that complement our products, and help push them forward,\" Cook said at the shareholder meeting.\nApple declined to comment for this story.",
    "word_count": 1324,
    "extraction_method": "handle_default"
  },
  {
    "title": "Indian regulator rejects Apple request to put antitrust report on hold",
    "summary": "",
    "url": "https://www.investing.com/news/stock-market-news/indian-regulator-rejects-apple-request-to-put-antitrust-report-on-hold-3738459",
    "source": "",
    "original_score": 0.9024378,
    "custom_score": 0.27073134,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:24:18.820933",
    "full_content": "By Aditya Kalra\nNEW DELHI (Reuters) - India's antitrust body has turned down a request from Apple (NASDAQ:AAPL) to put a hold on an investigation report which found the company breached competition laws, allowing the case to continue, an internal order from the regulator seen by Reuters showed.\nThe Competition Commission of India (CCI) in August ordered a recall of investigation reports after Apple said the watchdog had disclosed commercial secrets to competitors in the case dating back to 2021, including Tinder-owner Match. These elements should have been redacted.\nThe CCI had asked parties to return the reports and destroy any copies. The regulator then issued new reports.\nThe CCI internal order showed that Apple in November alleged that the main complainant in the antitrust investigation - Indian non-profit Together We Fight Society (TWFS) - had not complied with the directives to give an assurance that the old investigation reports had been destroyed.\nApple asked the CCI \"to take action against TWFS for non-compliance with its order\" and \"to withhold the revised\" report, the CCI order, dated Nov. 13, seen by Reuters showed.\n\"Apple's request to hold the investigation report in abeyance was deemed untenable,\" the CCI said in the order.\nApple did not respond to Reuters queries.\nThe CCI did not respond outside regular business hours on Sunday. Calls to representatives of TWFS went unanswered.\nA CCI investigation had found that Apple exploited its dominant position in the market for app stores on its iOS operating system to the detriment of app developers, users and other payment processors.\nApple has denied wrongdoing and said it is a small player in India where phones that use Google (NASDAQ:GOOGL)'s Android system are dominant.\nThe CCI internal order also showed that Apple has been asked to submit its audited financial statements for fiscal years 2021-22, 2022-23 and 2023-24 under regulatory guidelines aimed at determining possible monetary penalties in the case.\nThe CCI's senior officials will review the investigation report and make a final ruling on the case.",
    "word_count": 335,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple faces years of distractions after DOJ antitrust suit - CNBC",
    "summary": "",
    "url": "https://www.cnbc.com/2024/03/22/apple-doj-antitrust-suit-company-faces-years-of-distraction.html",
    "source": "",
    "original_score": 0.5135846,
    "custom_score": 0.15407537999999998,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:24:22.761679",
    "full_content": "The U.S. Department of Justice sued Apple on Thursday, accusing it of using the iPhone's market power to cut off rivals, kicking off a multiyear process involving hundreds of lawyers and threatening Apple's \"walled garden\" business model.\nIf the DOJ wins, it could seek a range of changes to Apple's business, and U.S. officials didn't rule out the possibility that Apple could face \"structural remedies\" or be broken up.\nIf Apple's arguments prevail, a court could rule that its estimated 64% of U.S. smartphone share isn't a monopoly, or that its conduct wasn't illegal, giving Apple new tools to fight off future regulation.\nBut before any of that happens, we'll likely see years of legal wrangling, during which Apple will be forced to defend its business in public, distract its executives with legal meetings, produce internal documents for the government and potentially face bad headlines that could hurt its brand or image.\nThe DOJ's lawsuit still needs to be assigned to a judge. In the short term, Apple could ask for a change of trial location away from New Jersey, and it will likely ask to dismiss the case entirely.\nAll these steps take varying amounts of time, and it's realistic the trial will be scheduled for 2025, and the appeal won't wrap up until 2027, depending on which judge is assigned the case, said William Kovacic, director of the Competition Law Center at George Washington University.\nOften, companies accused of antitrust violations like Apple like to drag out the trial, said John Newman, a professor of law at the University of Miami and a former DOJ attorney.\n\"In general, defendants love to drag their heels forever,\" Newman said. \"Is the judge going to go with what the defendant proposes, which is inevitably years and years, tons and tons of discovery? Drag it out forever? Or they can actually step up and try to control that?\" he continued.\nFor example, Google was sued by the DOJ in a similar case in October 2020, and it took nearly three years before it went to trial. Remedies haven't been decided and it hasn't gone through appeals. The DOJ case against Apple was inspired by a historic case against Microsoft filed in 1998. It went to trial later that year and an appeal was decided by 2001.\nA potential distraction\nLike the Microsoft trial, the Justice Department lawsuit against Apple is attempting to erect a new landmark decision for antitrust in the U.S., mostly by focusing on Apple's entire ecosystem, not just a product, and whether how it functions represents anti-competitive conduct.\nIn a statement provided to CNBC on Thursday, Apple said that the lawsuit \"threatens who we are\" and that it could hurt its ability to make competitive tech products.\nApple provides more details about why it doesn't like this kind of litigation in its SEC filings. The company says that when laws and regulations change, including antitrust litigation, it has to spend money to comply. \"Imposed\" changes can hurt customer demand, according to the filing, and when laws or regulations change, it creates uncertainty for Apple.\nAnother challenge for Apple may be that a big, public trial like this one competes for executive time and attention, and more decisions inside Apple may have to go through legal review before going forward.\nCompanies facing antitrust cases often need to loop employees who have nothing to do with trials into meetings, to sort through company documents, or help guide how the company will present evidence or technical arguments, Kovacic, a former FTC commissioner, said.\n\"In past major antitrust cases, the real danger for the company is that the focus of attention becomes winning the antitrust lawsuits instead of winning customers and doing your job,\" Kovacic said. \"It slows you down. It's a real drag.\"\nFor Apple, it's not just the DOJ suit, but also new regulations in Europe, and investigations in other countries around the world that it has to deal with.\nThe U.S. government hasn't said what it wants Apple to do to fix its allegations, but its initial filing on Thursday left the matter open, with a broad request for overall remedy.\nOne possibility includes forcing Apple to open the iPhone to third-party stores like it has in Europe. Many of the DOJ's other allegations, like Apple's alleged restrictions on third-party smartwatches and \"super apps\" don't have close recent parallels in other countries or markets. The DOJ could also find remedies that aim to reorient the entire technology industry or future products.\n\"If and when this thing gets to trial, I would expect that it will not just be about smartphones, even though that's the core of the story. This is really a case about the future of smart devices,\" Newman said.\nApple may, as it has in the past, choose to preemptively make changes or tweaks to targeted products to head off additional scrutiny. For example, in January, Apple partially opened its App Store to cloud gaming services, one of the key kinds of competitors that the Justice Department alleged that Apple cuts off.\nDiscovery and deposition\nGovernment lawyers will request internal, confidential Apple documents to bolster their case in a process called discovery. Apple's business partners may also get requests to show the government their own confidential documents. Generally, companies fear discovery, because it's unclear what will turn up, and Apple is particularly secretive about its internal documentation and strategy.\nDocuments unearthed through discovery are often posted publicly during the trial, exposing private deliberations.\nThe government will likely move to depose Apple's executives, including CEO Tim Cook, or even call them to the witness stand during the trial. Cook took the stand during a recent antitrust trial against Epic Games, for example.\nBut executive depositions or testimony can still be risky for technology companies, especially if executives cannot control their egos — former Microsoft CEO Bill Gates was famously petulant and showed utter contempt for the process during a videotaped deposition by David Boies in 1998 that was played during the trial.\n\"A lesson that the Gates deposition experience taught is that if you're a CEO, there is a real art and skill to doing a good deposition,\" Kovacic said. \"It requires you to suppress some of your 'Master of the Universe' impulses for the sake of doing a good job, and in this case, listening very carefully to the coaching of your lawyers.\"\nApple and the DOJ could also come to a settlement, where Apple makes some changes and the government drops the suit before further discovery or depositions. However, there are no public signs of reconciliation.\nApple declined to comment on Thursday when asked if there had been settlement talks.",
    "word_count": 1113,
    "extraction_method": "handle_default"
  },
  {
    "title": "AAPL | Apple Inc. Stock Overview (U.S.: Nasdaq) - Barron's",
    "summary": "",
    "url": "https://www.barrons.com/market-data/stocks/aapl",
    "source": "",
    "original_score": 0.76629364,
    "custom_score": 0.229888092,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:24:46.552807",
    "full_content": "AAPL | Apple Inc. Stock Overview (U.S.: Nasdaq) | Barron's\nSummary\nSummary\nU.S\nEurope\nAsia\nFX\nRates\nFutures\nETFs\nCrypto\nDJIA\nS&P 500\nNASDAQ\nRussell 2000\nU.S. 10 Yr\nVIX\nBitcoin\nCrude Oil\nDollar Index\nFuture Index\nBarron's 400\nMarket Data\n/\nStocks\n/\nAAPL\n/\nOverview\nApple Inc.\nU.S.: Nasdaq\n0.00\nAAPL\nDelayed quote\nAbout Apple Inc.\nApple, Inc. engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other varieties of related services. It operates through the following geographical segments: Americas, Europe, Greater China, Japan, and Rest of Asia Pacific. The Americas segment includes North and South America. The Europe segmen...\nSee Full Profile\nAnalyst Ratings\nAverage price target from\n52\nratings: $\n244.09\nAverage score:\nSell\nUnder\nHold\nOver\nBuy\nFull Ratings\nStockGrader\nRating:\nSentiment:\nFull Analysis\nOpen\n$228.06\nPrevious Close\n-\nYTD Change\n19.39%\n12 Month Change\n21.00%\nDay Range\n228.06 - 230.72\n52 Wk Range\n164.08 - 237.49\nVolume\n38.17M (79.91% of Avg)\n65 Day Avg: 47.77M\nVolume\n47.77M\nMarket Value\n$3.47T\nShares Outstanding\n15.12B\nEPS\n(TTM)\n$6.07\nP/E Ratio\n(TTM)\n37.87\nDividend Yield\n0.44%\nLatest Dividend\n$0.25\nEx-Dividend Date\nNov 8, 2024\nBeta\n1.17\nShort Interest\n133.04M\n(\n10/31/24\n)\nShort Interest Change\n-5.59%\nPercent of Float\n0.88%\nAdvanced\n$\n$\n%\nVol\n1D\n1D\n5D\n1M\n3M\n6M\nYTD\n1Y\n3Y\nAll\nCompare\nDow Jones Industrial Average\nS&P 500\nNasdaq\nS&P 400 Mid Cap\nRussell 2000\nRemove Comparison\nPeers\nName\nChg %\nMarket Cap\nMicrosoft Corp.\n1.00\n%\n$3.07T\nAlphabet Inc. Cl C\n-1.58\n%\n$2.06T\nAlphabet Inc. Cl A\n-1.71\n%\n$2.06T\nAmazon.com Inc.\n-0.64\n%\n$2.09T\nMeta Platforms Inc.\n-0.70\n%\n$1.42T\nSamsung Electronics Co. Ltd.\n-0.71\n%\n₩373.89T\nSamsung Electronics Co. Ltd. Pfd. Series 1\n-1.43\n%\n₩373.89T\nSony Group Corp.\n-0.12\n%\n¥18.29T\nDell Technologies Inc. Cl C\n3.81\n%\n$101.2B\nRecently Viewed\nSymbol\n% Chg\nPrice\nOverview\nCompany & People\nFinancials\nResearch & Ratings\nStockGrader\nAdvanced Chart\nnews\nBarron's\nOther Dow Jones\nPress Releases\nLoading data\nPeople\nKey Executives\nBoard Members\nTimothy Donald Cook\nChief Executive Officer & Director\nWanda M. Austin\nIndependent Director\nJeffrey E. Williams\nChief Operating Officer\nArthur D. Levinson\nIndependent Chairman\nLuca Maestri\nChief Financial Officer & Senior Vice President\nMonica Cecilia Lozano\nIndependent Director\nSee All on Company & People\nMajor Holders\nMUTUAL FUNDS\nINSTITUTIONAL\nDIRECT HOLDERS\nNo data provided\nFinancials\nAnnual\nQuarterly\n2024\nRevenue\n391.04B\nNet Income\n93.74B\nNet Profit Margin\n23.97%\n2024\nTotal Assets\n364.98B\nTotal Liabilities\n308.03B\nDebt to Assets\n84.40%\n2024\nOperating\n118.25B\nInvesting\n2.94B\nFinancing\n-121.98B\nSee All Financials\nNotes & Data Providers\nStocks:\nReal-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSet\nIndexes:\nIndex quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\nMarkets Diary:\nData on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See\nClosing Diaries\ntable for 4 p.m. closing data. Sources: FactSet, Dow Jones\nStock Movers:\nGainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\nETF Movers:\nIncludes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\nBonds:\nBond quotes are updated in real-time. Sources: FactSet, Tullett Prebon\nCurrencies:\nCurrency quotes are updated in real-time. Sources: FactSet, Tullett Prebon\nCommodities & Futures:\nFutures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\nMutual Funds & ETFs:\nAll of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\nCryptocurrencies:\nCryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\nCalendars and Economy:\n'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media\nBarron's\nTopics\nCryptocurrencies\nData\nMagazine\nMarkets\nStock Picks\nBarron's Live\nRoundtable\nBarron's Stock Screen\nPersonal Finance\nStreetwise\nAdvisor Directory\nMemberships\nSubscribe to Barron's\nTools\nSaved Articles\nWatchlist\nNewsletters\nVideo Center\nCustomer Service\nCustomer Center\nNetwork\nThe Wall Street Journal\nMarketWatch\nInvestor's Business Daily\nMansion Global\nFinancial News London\nDow Jones Smart Money\nNewsstand\nBuy Issues\nReprints\nE-Edition\nFor Business\nCorporate Subscriptions\nFor Education\nInvesting in Education\nFor Advertisers\nPress & Media Inquiries\nAdvertising\nAccount\nSign In\nSubscriber Benefits\nManage Notifications\nManage Alerts\nAbout Barron's\nLive Events\nCentennial\nPrivacy Notice\nCookie Notice\nCopyright Policy\nAccessibility\nData Policy\nYour Ad Choices\nTerms of Use\nCommunity Rules\nBarron's Archive\nCopyright © 2024 Dow Jones & Company, Inc. All Rights Reserved.",
    "word_count": 992,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple Inc. Analyst Estimates - AAPL - MarketWatch",
    "summary": "",
    "url": "https://www.marketwatch.com/investing/stock/aapl/analystestimates",
    "source": "",
    "original_score": 0.9868787,
    "custom_score": 0.49606361,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:25:52.767933",
    "full_content": "AAPL | Apple Inc. Analyst Estimates | MarketWatch\nUS\nEurope\nAsia\nFX\nRates\nFutures\nCrypto\nDow\n0.97%\nS&P 500\n0.35%\nNasdaq\n0.16%\nVIX\n-9.66%\nGold\n0.22%\nOil\n-0.07%\nUS\nEurope\nAsia\nFX\nRates\nFutures\nCrypto\nRange\nDropdown Markets\n1D\n5D\n1M\n3M\n6M\n1Y\n2Y\nDow\n44,296.51\n426.16\n0.97%\nS&P 500\n5,969.34\n20.63\n0.35%\nNasdaq\n19,003.65\n31.23\n0.16%\nVIX\n15.24\n-1.63\n-9.66%\nGold\n2,718.20\n6.00\n0.22%\nOil\n71.19\n-0.05\n-0.07%\nS&P 500 Movers\nSMCI\n11.6\nCPRT\n10.2\nMRNA\n7.5\nDECK\n5.6\nINTU\n-5.7\nPANW\n-3.6\nNTAP\n-3.4\nNVDA\n-3.2\nVisit Market Data Center\nLatest News\nAll Times Eastern\nscroll up\nscroll down\n4:05p\nWill inflation stick around? What oil, gold and stocks are signaling about rising prices.\n3:54p\nMore retailers squeeze in earnings reports before Black Friday with holidays and tariffs in focus\n3:44p\nIsrael says rabbi who went missing in UAE was killed in ‘terror incident’\n3:18p\nIt’s no ‘Barbenheimer,’ but ‘Wicked’ and ‘Gladiator II’ deliver welcome box-office boost\n3:09p\nRepublicans lash out at Democrats’ claims that Trump’s intelligence pick Tulsi Gabbard is ‘compromised’\n2:57p\nFrom bibles to sneakers to guitars: Trump-branded merchandise is everywhere, but could it create legal woes for the president-elect?\n2:45p\nBarron's\nThanksgiving Dinner Will Cost 5% Less This Year\n2:00p\nBarron's\nBest Buy, Zoom, CrowdStrike, Macy’s, and More Stocks to Watch This Week\n1:21p\nBarron's\nWicked, Gladiator II Light Up Weekend Box Office\n12:46p\nBarron's\nElon Musk Versus Lockheed? Say It Ain’t So.\nHome\nInvesting\nQuotes\nStocks\nUnited States\nAAPL\nAnalyst Estimates\nStock Screener\nEarnings Calendar\nSectors\nNasdaq\nSearch Ticker\n|\nAAPL\nU.S.: Nasdaq\nApple Inc.\nWatch\nlist\nAlert\nAAPL\nUS\nAfter Hours\nLast Updated:\nNov 22, 2024 7:59 p.m.\nEST\nDelayed quote\n$\n229.94\n0.07\n0.03%\nAfter Hours Volume:\n5.06M\nClose\nChg\nChg %\n$229.87\n1.35\n0.59%\nToggle Chart Options\nAdvanced Charting\n1D\n5D\n1M\n3M\n6M\nYTD\n1Y\n3Y\nAll\nRange Dropdown\n$\n%\nVol\nVolume: 38.17M\n65 Day Avg: 47.77M\n80% vs Avg\n228.06\nDay Range\n230.72\n164.08\n52 Week Range\n237.49\nCustomize MarketWatch\nHave Watchlists? Log in to see them here or sign up to get started.\nCreate Account\n… or\nLog In\nSymbol\nCompany\nPrice\nChg/Chg %\n(\nGo to Your Watchlist\n)\nNo Items in Watchlist\nThere are currently no items in this Watchlist.\nAdd Tickers\nNo Saved Watchlists\nCreate a list of the investments you want to track.\nCreate Watchlist\n…or\nlearn more\nUh oh\nSomething went wrong while loading Watchlist.\nGo to Watchlist\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSearch Tickers\nOverview\nProfile\nCharts\nFinancials\nHistorical Quotes\nAnalyst Estimates\nOptions\nPremium Tools\nAverage Recommendation\nOverweight\nAverage Target Price\n244.09\nNumber Of Ratings\n52\nFY Report Date\n9/2025\nLast Quarter's Earnings\n0.97\nYear Ago Earnings\n6.71\nCurrent Quarter's Estimate\n2.36\nCurrent Year's Estimate\n7.37\nMedian PE on CY Estimate\nN/A\nNext Fiscal Year Estimate\n8.25\nMedian PE on Next FY Estimate\nN/A\nHigh\n$300.00\nMedian\n$250.00\nLow\n$184.00\nAverage\n$244.09\nCurrent Price\n$228.52\nEstimates\nAAPL will report 2025 earnings on 10/23/2025\n2024\n2025\n2026\n2027\nHigh\n6.90\n7.85\n9.35\n11.47\nLow\n6.57\n6.70\n7.39\n7.75\nAverage\n6.71\n7.37\n8.25\n9.24\nActuals\nEstimates\nAAPL will report Q1 2025 earnings on 01/30/2025\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nEstimate\n2.10\n1.51\n1.35\n1.60\nActual\n2.18\n1.53\n1.40\n0.97\nSurprise\n0.08\n0.02\n0.05\n-0.63\nQ1 2025\nQ2 2025\nHigh\n2.50\n1.82\nLow\n2.19\n1.51\nAverage\n2.36\n1.69\n3M Ago\n1M Ago\nCurrent\nBuy\n23\n25\n24\nOverweight\n9\n9\n10\nHold\n13\n14\n15\nUnderweight\n1\n1\n1\nSell\n1\n2\n2\nConsensus\nOverweight\nOverweight\nOverweight\nDate\nCategory\nAnalyst Firm\nInfo\n11/1/2024\nMaintains\nMaxim Group\n11/1/2024\nMaintains\nBarclays\n11/1/2024\nMaintains\nRosenblatt\n11/1/2024\nReiterates\nNeedham\n10/25/2024\nDowngrades\nKeybanc\nView All Upgrades & Downgrades\nCurrent\n$7.37\n1 Month Ago\n$7.41\n3 Months Ago\n$7.45\nCurrent\n$8.25\n1 Month Ago\n$8.27\n3 Months Ago\n$8.33\nCurrent\n$2.36\n1 Month Ago\n$2.39\n3 Months Ago\n$2.37\nCurrent\n$1.69\n1 Month Ago\n$1.71\n3 Months Ago\n$1.71\nClose Trending Tickers bar\nAZTA\n$43.16\n-4.43%\n-2.00\nFLEX\n$41.34\n0.10%\n0.04\nPDYN\n$4.80\n4.35%\n0.20\nWPM\n$64.00\n0.30%\n0.19\nAccess Premium Tools\nSearch\nClear\nSearch\nAdvanced Search\nSymbols\nLoading...\nPrivate Companies\nLoading...\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSearch Tickers\nAll News\nArticles\nVideo\nPodcasts\nAuthors\nSections\nColumns\n×\n×\nThis browser is no longer supported at MarketWatch. For the best MarketWatch.com experience, please update to a modern browser.\nChrome\nSafari\nFirefox\nEdge",
    "word_count": 748,
    "extraction_method": "handle_default"
  },
  {
    "title": "5 big analyst AI moves: Apple downgraded; Microsoft pullback an ...",
    "summary": "",
    "url": "https://www.investing.com/news/stock-market-news/5-big-analyst-ai-moves-apple-downgraded-microsoft-pullback-an-opportunity-3684659",
    "source": "",
    "original_score": 0.96538115,
    "custom_score": 0.589614345,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:25:53.976956",
    "full_content": "Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week.\nInvestingPro subscribers always get first dibs on market-moving AI analyst comments. Upgrade today!\nKeyBanc downgrades Apple stock on iPhone sales worries\nKeyBanc analysts downgraded Apple (NASDAQ:AAPL) from Sector Weight to an Underweight rating this week, pointing to concerns surrounding sales of the company’s flagship iPhone.\nAnalysts led by Brandon Nispel said in a client note that demand for the lower-cost iPhone SE, based on a survey conducted by the investment bank, is “not purely additive” to overall iPhone sales, suggesting potential overlap with other models.\nFurther analysis from KeyBanc indicates that the rate of phone upgrades in the U.S. is “unlikely to move higher” in the near term.\nWhile some industry watchers have forecasted a wave of upgrades as customers take advantage of new AI-enhanced features in the iPhone 16, Nispel’s findings paint a more complex picture.\n“Our survey shows that 59% of respondents are interested in upgrading to iPhone 16, which appears strong,” he wrote. “However, our survey also shows that of those respondents who are likely or extremely likely to upgrade to the iPhone 16, 61% are interested in the iPhone SE.”\n“We think this shows the iPhone SE is not incremental, and could possibly be cannibalistic to iPhone 16 sales.”\nNispel also tempered expectations of a major growth surge for Apple, stating that projections for “Apple’s highest growth in 3 [plus] years and a major inflection in all geographies and products” are overly optimistic. He noted that growth of this magnitude has “rarely [...] occurred throughout history.”\nMoreover, Apple’s current valuation is under scrutiny. With shares trading at approximately 23 times forward earnings - a premium five times that of the Nasdaq Composite index - the stock “appears expensive relative to its history and peers,” Nispel explained.\nHistorically, Apple’s three-year average valuation hovers around 20 times forward earnings, while the Nasdaq’s average premium is closer to 3 times.\nBuy Microsoft stock pullback, Citi says\nCiti analysts suggest that Microsoft (NASDAQ:MSFT) shares could be a buying opportunity after a recent pullback, pointing to potential upside in the coming quarters.\nThe recent underperformance in Microsoft’s stock, they note, is driven by investor concerns over large capital expenditure increases and slower-than-anticipated growth in Azure services and earnings per share (EPS).\nIn their Wednesday note, Citi analysts reviewed data from Microsoft resellers and Chief Information Officers (CIOs), showing a stable environment in the September quarter.\n“Survey showed healthy reseller quota achievement levels (strongest YTD) despite some moderation in growth expectations,” they said. Although some feedback from customers and partners was “more mixed,” Citi highlighted signs of larger Microsoft 365 CoPilot deals despite overall softer large-deal momentum.\nThe Wall Street firm projects that Microsoft’s second fiscal quarter results might slightly beat investor expectations, which have already been tempered. Lower expectations could act as a “clearing event,” allowing Microsoft to exceed key performance indicators, especially in Azure consumption growth.\nAnalysts anticipate Microsoft will maintain its full-year targets for double-digit growth and reiterate strong capital expenditure plans.\nWhile Citi expects Q2 guidance to be largely in line, potentially limiting positive revisions, the firm sees an opportunity for more compelling tactical positioning post-Q1.\n“We are buyers of the pullback in shares as we expect investor sentiment to turn more positive post-Q ahead of a 2H reacceleration in Azure growth and EPS growth,” the analysts said.\nA fragmented Intel would be worth more: Northland analysts\nAnalysts at Northland Capital Markets believe Intel (NASDAQ:INTC) might be more valuable as a series of smaller entities than in its current structure.\nIntel shares have dropped over 52% this year as the company continues to face challenges in keeping pace with competitors like Nvidia (NASDAQ:NVDA) in the AI chip manufacturing arena.\n\"Intel Products continues to lose market share and lacks a competitive AI product,\" Northland analysts noted in a recent client report.\nIntel announced in August plans to reduce capital expenditures by 17% year-over-year to $21.5 billion and issued a third-quarter forecast that missed Wall Street’s expectations. The company also announced job cuts affecting more than 15% of its workforce - around 17,500 employees - and will suspend its dividend in the fourth quarter as part of broader restructuring efforts.\nCEO Pat Gelsinger and Intel's leadership team are reportedly weighing a possible separation of its product-design and manufacturing arms as part of a strategic overhaul, according to reports by Bloomberg News.\nAt the same time, Qualcomm (NASDAQ:QCOM) has expressed interest in acquiring portions of Intel’s design division, potentially including the PC design business, Reuters reported.\nMarvell (NASDAQ:MRVL) Technology is also eyeing Intel’s programmable chip segment, Altera, as a potential acquisition target.\nDespite these setbacks, Northland analysts maintain that \"Intel, broken up into pieces, is worth more than its current valuation.\"\nGelsinger has placed Intel's foundry business at the center of his turnaround strategy. Recently, Intel’s foundry division, which secured Amazon (NASDAQ:AMZN) as a client for custom AI chips, is set to become an independent subsidiary with its own operating board.\nMorgan Stanley cautious on AMD\nShares of Advanced Micro Devices (NASDAQ:AMD) fell Tuesday after Morgan Stanley issued cautious remarks regarding the chipmaker’s AI supply chain strategy.\nIn a note to clients, Morgan Stanley analysts pointed to AMD's recent decision to lower its CoWoS wafer bookings at Taiwan Semiconductor Manufacturing Company (TSMC) for 2025, citing uncertainty surrounding demand for the MI325 processor.\n\"AMD seems to have trimmed some CoWoS wafer booking at TSMC for 2025 given uncertainty around MI325 demand,\" the analysts stated, suggesting a conservative stance from AMD as it navigates potential volatility in AI processor demand.\nIn contrast, Nvidia reportedly stepped in to fill the newly available capacity at TSMC.\nMorgan Stanley’s note reflects a broader view of intensified competition within the AI sector, where Nvidia has strengthened its leadership.\nAdditionally, the bank noted that “WPG sales grew 25% Q/Q in 3Q vs. previous guidance of only up 5.5% Q/Q,” attributing the growth to “increasing business coming from AMD CPU and ‘GPU.’”\nWedbush expecting a strong earnings season for tech sector\nWedbush analysts expect a strong third-quarter earnings season for the tech sector, supported by robust enterprise spending and a resurgence in digital advertising.\nAccording to Wedbush, the key theme this earnings season will be the next phase of the AI revolution. Major cloud players- Microsoft, Google (NASDAQ:GOOGL), and Amazon - are expected to deliver significant growth that surpasses Wall Street’s expectations, fueled by an accelerating migration of workloads to the cloud.\nThis shift, Wedbush analysts suggest, is paving the way for a wide array of AI enterprise use cases to be deployed by 2025.\nWedbush sees cloud strength extending beyond the dominant providers, pointing out that companies like Oracle (NYSE:ORCL), SAP SE (ETR:SAPG), IBM (NYSE:IBM), ServiceNow (NYSE:NOW), and Dell (NYSE:DELL) are also poised to benefit as enterprises increase AI and cloud deployments.\nThese firms are seen as “foundational cloud stock players,” well-positioned to capitalize on what Wedbush describes as the “second derivative” of the AI movement.\n\"We believe 70% of global workloads will be on the cloud by the end of 2025, up from less than 50% today,\" the analysts remarked, underlining the rapid adoption trajectory.\nWedbush maintains an optimistic outlook on tech stocks, forecasting a potential 20% upside in 2025.\nWith the Federal Reserve, led by Jerome Powell, likely entering an aggressive rate-cutting phase, Wedbush envisions a “soft landing” for the macroeconomy. They emphasize that AI spending represents a generational shift in tech investment, with impacts on the sector just beginning to unfold.",
    "word_count": 1254,
    "extraction_method": "handle_default"
  },
  {
    "title": "Apple's stock draws a downgrade as AI optimism may ... - MarketWatch",
    "summary": "",
    "url": "https://www.marketwatch.com/story/apples-stock-draws-a-downgrade-as-ai-optimism-may-be-very-premature-54b84afe",
    "source": "",
    "original_score": 0.9383503,
    "custom_score": 0.58150509,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:25:55.018571",
    "full_content": "Apple’s stock draws a downgrade as AI optimism may be very premature - MarketWatch\n✕\nSEARCH\nAdvanced Search\n➔\nSearch Results\nSymbols\nNo results found\nPrivate Companies\nNo results found\nRecently Viewed Tickers\nAll News\nArticles\nVideo\nPodcasts\nNo Results Found\nAuthors\nNo results found\nSections\nNo results found\nColumns\nNo results found\nThe Ratings Game\nApple’s stock draws a downgrade as AI optimism may be very premature\nA Jefferies analyst says it will take time for smartphone technology to truly support AI. That means sales expectations for the iPhone 16, and perhaps even the iPhone 17, may be too high.\nPublished:\nOct. 7, 2024 at 8:30 a.m. ET\nApple’s iPhone 16 lineup has been on sale for several weeks.\nPhoto:\nJustin Sullivan/Getty Images\nHoping the iPhone 16 will drive a big wave of device upgrades? That view looks “premature,” in the view of one analyst.\nJefferies’ Edison Lee assumed coverage of Apple Inc. shares\nAAPL\nover the weekend, and in doing so, downgraded the stock to hold from buy. By his assessment, it will take some time for artificial intelligence to improve the smartphone experience.\nAbout the Author\nEmily Bary\nEmily Bary is a MarketWatch news editor based in New York.\nShow Conversation\n(0)\nBack To Top\nCopyright ©\n2024\nMarketWatch, Inc. All rights reserved.\nTerms of Use\nUPDATED\nPrivacy Notice\nCookie Notice\nMarketWatch\nCustomer Center\nContact Us\nNewsroom Roster\nVirtual Stock Exchange\nMarketWatch Guides\nCopyright Policy\nManage Notifications\nCancel My Subscription\nCompany\nDow Jones\nCode of Conduct\nCorrections\nReprints & Licensing\nDigital Self Service\nYour Ad Choices\nCorporate Subscriptions\nAccessibility\nDow Jones Network\nThe Wall Street Journal\nBarron's\nInvestor's Business Daily\nBigCharts\nFinancial News London\nrealtor.com\nMansion Global\nDow Jones Smart Money\nIntraday Data provided by\nFACTSET\nand subject to\nterms of use.\nHistorical and current end-of-day data provided by\nFACTSET\n. All quotes are in local exchange time. Real-time last sale data for U.S. stock quotes reflect trades reported through Nasdaq only. Intraday data delayed at least 15 minutes or per exchange requirements.",
    "word_count": 336,
    "extraction_method": "handle_default"
  },
  {
    "title": "Analyst Upgrades & Downgrades - MarketWatch",
    "summary": "",
    "url": "https://www.marketwatch.com/tools/upgrades-downgrades",
    "source": "",
    "original_score": 0.5554352,
    "custom_score": 0.46663056,
    "publish_date": "",
    "ticker": "AAPL",
    "company_name": "Apple Inc",
    "collected_at": "2024-11-25T00:25:56.212226",
    "full_content": "Analyst Upgrades & Downgrades  - MarketWatch\nHome\nTools\nAnalyst Upgrades & Downgrades\nDate\nSymbol\nCompany\nCategory\nAnalyst Firm\nInfo\n11/22/2024\nGAP\nGap\nMaintains\nUBS\n11/22/2024\nBJ\nBJ's Wholesale Club\nMaintains\nUBS\n11/22/2024\nDE\nDeere\nMaintains\nUBS\n11/22/2024\nCRM\nSalesforce\nMaintains\nUBS\n11/22/2024\nFITB\nFifth Third Bancorp\nMaintains\nCitigroup\n11/22/2024\nBE\nBloom Energy\nMaintains\nJefferies\n11/22/2024\nSLG\nSL Green Realty\nMaintains\nJefferies\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nDA Davidson\n11/22/2024\nNVDA\nNVIDIA\nMaintains\nDA Davidson\n11/22/2024\nESTC\nElastic\nMaintains\nDA Davidson\n11/22/2024\nSAH\nSonic Automotive\nUpgrades\nSeaport Global\n11/22/2024\nNVGS\nNavigator Holdings\nMaintains\nJefferies\n11/22/2024\nZM\nZoom Video Comms\nMaintains\nRosenblatt\n11/22/2024\nESTC\nElastic\nMaintains\nRosenblatt\n11/22/2024\nAIOT\nPowerFleet\nMaintains\nBarrington Research\n11/22/2024\nTTD\nTrade Desk\nMaintains\nMacquarie\n11/22/2024\nNLY\nAnnaly Capital Management\nMaintains\nJones Trading\n11/22/2024\nWMG\nWarner Music Gr\nMaintains\nMacquarie\n11/22/2024\nCTXR\nCitius Pharma\nDowngrades\nD. Boral Capital\n11/22/2024\nACCO\nACCO Brands\nMaintains\nBarrington Research\n11/22/2024\nBERY\nBerry Global Gr\nDowngrades\nUBS\n11/22/2024\nAN\nAutoNation\nMaintains\nSeaport Global\n11/22/2024\nGPI\nGroup 1 Automotive\nMaintains\nSeaport Global\n11/22/2024\nLAD\nLithia Motors\nMaintains\nSeaport Global\n11/22/2024\nGES\nGuess\nReiterates\nSmall Cap Consumer Research\n11/22/2024\nPAG\nPenske Automotive Group\nMaintains\nSeaport Global\n11/22/2024\nLXRX\nLexicon Pharmaceuticals\nReiterates\nNeedham\n11/22/2024\nWMG\nWarner Music Gr\nReiterates\nGuggenheim\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nScotiabank\n11/22/2024\nROST\nRoss Stores\nReiterates\nGuggenheim\n11/22/2024\nESTC\nElastic\nMaintains\nScotiabank\n11/22/2024\nNXT\nNEXTracker\nReiterates\nGuggenheim\n11/22/2024\nJACK\nJack In The Box\nMaintains\nTruist Securities\n11/22/2024\nESTC\nElastic\nMaintains\nTruist Securities\n11/22/2024\nSNOW\nSnowflake\nMaintains\nCitigroup\n11/22/2024\nDE\nDeere\nMaintains\nTruist Securities\n11/22/2024\nGAP\nGap\nReiterates\nGuggenheim\n11/22/2024\nNTAP\nNetApp\nMaintains\nCitigroup\n11/22/2024\nXEL\nXcel Energy\nMaintains\nMorgan Stanley\n11/22/2024\nADSK\nAutodesk\nMaintains\nCitigroup\n11/22/2024\nVST\nVistra\nMaintains\nMorgan Stanley\n11/22/2024\nSR\nSpire\nMaintains\nMorgan Stanley\n11/22/2024\nNVDA\nNVIDIA\nDowngrades\nPhillip Securities\n11/22/2024\nSO\nSouthern\nMaintains\nMorgan Stanley\n11/22/2024\nPNW\nPinnacle West Capital\nMaintains\nMorgan Stanley\n11/22/2024\nNEE\nNextEra Energy\nMaintains\nMorgan Stanley\n11/22/2024\nFE\nFirstEnergy\nMaintains\nMorgan Stanley\n11/22/2024\nEXC\nExelon\nMaintains\nMorgan Stanley\n11/22/2024\nPDD\nPDD Holdings\nDowngrades\nJP Morgan\n11/22/2024\nESTC\nElastic\nMaintains\nGuggenheim\n11/22/2024\nCPK\nChesapeake Utilities\nMaintains\nGuggenheim\n11/22/2024\nEIX\nEdison Intl\nMaintains\nMorgan Stanley\n11/22/2024\nCSIQ\nCanadian Solar\nInitiates Coverage On\nJefferies\n11/22/2024\nNTAP\nNetApp\nMaintains\nTD Cowen\n11/22/2024\nDUK\nDuke Energy\nMaintains\nMorgan Stanley\n11/22/2024\nDTE\nDTE Energy\nMaintains\nMorgan Stanley\n11/22/2024\nBJ\nBJ's Wholesale Club\nMaintains\nTD Cowen\n11/22/2024\nUGI\nUGI\nInitiates Coverage On\nJefferies\n11/22/2024\nCEG\nConstellation Energy\nMaintains\nMorgan Stanley\n11/22/2024\nTTWO\nTake-Two Interactive\nMaintains\nTD Cowen\n11/22/2024\nED\nConsolidated Edison\nMaintains\nMorgan Stanley\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nJefferies\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nTD Cowen\n11/22/2024\nCNP\nCenterPoint Energy\nMaintains\nMorgan Stanley\n11/22/2024\nTJX\nTJX Companies\nMaintains\nTD Cowen\n11/22/2024\nCMS\nCMS Energy\nMaintains\nMorgan Stanley\n11/22/2024\nESTC\nElastic\nMaintains\nJefferies\n11/22/2024\nATO\nAtmos Energy\nMaintains\nMorgan Stanley\n11/22/2024\nXPEV\nXPeng\nUpgrades\nChina Renaissance\n11/22/2024\nAEP\nAmerican Electric Power\nMaintains\nMorgan Stanley\n11/22/2024\nINTU\nIntuit\nMaintains\nJefferies\n11/22/2024\nAEE\nAmeren\nMaintains\nMorgan Stanley\n11/22/2024\nPOET\nPOET Technologies\nMaintains\nCraig-Hallum\n11/22/2024\nNKSH\nNational Bankshares\nUpgrades\nJanney Montgomery Scott\n11/22/2024\nLFCR\nLifecore Biomedical\nMaintains\nCraig-Hallum\n11/22/2024\nCARG\nCarGurus\nMaintains\nJMP Securities\n11/22/2024\nCRNC\nCerence\nMaintains\nCraig-Hallum\n11/22/2024\nPMTS\nCPI Card\nInitiates Coverage On\nDA Davidson\n11/22/2024\nBL\nBlackLine\nMaintains\nJMP Securities\n11/22/2024\nEXE\nExpand Energy\nMaintains\nRBC Capital\n11/22/2024\nWALD\nWaldencast\nMaintains\nCanaccord Genuity\n11/22/2024\nINTU\nIntuit\nReiterates\nRBC Capital\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nCanaccord Genuity\n11/22/2024\nESTC\nElastic\nMaintains\nCanaccord Genuity\n11/22/2024\nNMRA\nNeumora Therapeutics\nReiterates\nRBC Capital\n11/22/2024\nCATX\nPerspective Therapeutics\nMaintains\nOppenheimer\n11/22/2024\nOCSL\nOaktree Specialty Lending\nMaintains\nOppenheimer\n11/22/2024\nMGRC\nMcGrath RentCorp\nMaintains\nOppenheimer\n11/22/2024\nKD\nKyndryl Hldgs\nMaintains\nOppenheimer\n11/22/2024\nINTU\nIntuit\nMaintains\nOppenheimer\n11/22/2024\nESTC\nElastic\nMaintains\nOppenheimer\n11/22/2024\nDE\nDeere\nMaintains\nOppenheimer\n11/22/2024\nADSK\nAutodesk\nMaintains\nOppenheimer\n11/22/2024\nSLQT\nSelectQuote\nReiterates\nRBC Capital\n11/22/2024\nKLC\nKinderCare Learning\nMaintains\nBMO Capital\n11/22/2024\nREPL\nReplimune Group\nMaintains\nBMO Capital\n11/22/2024\nKC\nKingsoft Cloud Hldgs\nUpgrades\nNomura\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nBMO Capital\n11/22/2024\nGAP\nGap\nMaintains\nBMO Capital\n11/22/2024\nPANW\nPalo Alto Networks\nDowngrades\nHSBC\n11/22/2024\nASGN\nASGN\nUpgrades\nBMO Capital\n11/22/2024\nESTC\nElastic\nMaintains\nPiper Sandler\n11/22/2024\nNOVA\nSunnova Energy Intl\nMaintains\nPiper Sandler\n11/22/2024\nSTEM\nStem\nMaintains\nPiper Sandler\n11/22/2024\nSHLS\nShoals Technologies Gr\nMaintains\nPiper Sandler\n11/22/2024\nNXT\nNEXTracker\nMaintains\nPiper Sandler\n11/22/2024\nGNRC\nGenerac Hldgs\nMaintains\nPiper Sandler\n11/22/2024\nFSLR\nFirst Solar\nMaintains\nPiper Sandler\n11/22/2024\nENPH\nEnphase Energy\nMaintains\nPiper Sandler\n11/22/2024\nUSAC\nUSA Compression Partners\nReiterates\nRBC Capital\n11/22/2024\nBE\nBloom Energy\nMaintains\nPiper Sandler\n11/22/2024\nTFSL\nTFS Financial\nAssumes\nPiper Sandler\n11/22/2024\nRUN\nSunrun\nDowngrades\nPiper Sandler\n11/22/2024\nATKR\nAtkore\nMaintains\nRBC Capital\n11/22/2024\nENIC\nEnel Chile\nDowngrades\nScotiabank\n11/22/2024\nCWAN\nClearwater Analytics Hldg\nMaintains\nRBC Capital\n11/22/2024\nEMN\nEastman Chemical\nReiterates\nRBC Capital\n11/22/2024\nESTC\nElastic\nMaintains\nRBC Capital\n11/22/2024\nENPH\nEnphase Energy\nMaintains\nRBC Capital\n11/22/2024\nWMG\nWarner Music Gr\nMaintains\nJP Morgan\n11/22/2024\nIQ\niQIYI\nMaintains\nJP Morgan\n11/22/2024\nEVH\nEvolent Health\nMaintains\nJP Morgan\n11/22/2024\nVSTS\nVestis\nMaintains\nJP Morgan\n11/22/2024\nGAP\nGap\nMaintains\nJP Morgan\n11/22/2024\nROST\nRoss Stores\nMaintains\nJP Morgan\n11/22/2024\nPEB\nPebblebrook Hotel\nUpgrades\nStifel\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nKeybanc\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nJP Morgan\n11/22/2024\nDRH\nDiamondrock Hospitality\nDowngrades\nStifel\n11/22/2024\nCRWD\nCrowdStrike Holdings\nMaintains\nKeybanc\n11/22/2024\nSR\nSpire\nMaintains\nStifel\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nStifel\n11/22/2024\nNTAP\nNetApp\nMaintains\nStifel\n11/22/2024\nMASI\nMasimo\nReiterates\nStifel\n11/22/2024\nIVA\nInventiva\nMaintains\nStifel\n11/22/2024\nPDD\nPDD Holdings\nMaintains\nBenchmark\n11/22/2024\nINTU\nIntuit\nMaintains\nStifel\n11/22/2024\nHST\nHost Hotels & Resorts\nMaintains\nStifel\n11/22/2024\nCLNN\nClene\nMaintains\nBenchmark\n11/22/2024\nESTC\nElastic\nMaintains\nStifel\n11/22/2024\nINTU\nIntuit\nMaintains\nJP Morgan\n11/22/2024\nPRTH\nPriority Tech Holdings\nMaintains\nKeefe, Bruyette & Woods\n11/22/2024\nAUB\nAtlantic Union Bankshares\nMaintains\nKeefe, Bruyette & Woods\n11/22/2024\nIBP\nInstalled Building Prods\nMaintains\nJP Morgan\n11/22/2024\nVSTS\nVestis\nMaintains\nGoldman Sachs\n11/22/2024\nBIDU\nBaidu\nMaintains\nBenchmark\n11/22/2024\nINSM\nInsmed\nMaintains\nJP Morgan\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nGoldman Sachs\n11/22/2024\nESTC\nElastic\nMaintains\nGoldman Sachs\n11/22/2024\nESTC\nElastic\nMaintains\nJP Morgan\n11/22/2024\nROST\nRoss Stores\nMaintains\nEvercore ISI Group\n11/22/2024\nDE\nDeere\nMaintains\nJP Morgan\n11/22/2024\nBBY\nBest Buy Co\nMaintains\nJP Morgan\n11/22/2024\nIQ\niQIYI\nReiterates\nBenchmark\n11/22/2024\nGAP\nGap\nMaintains\nEvercore ISI Group\n11/22/2024\nEWTX\nEdgewise Therapeutics\nInitiates Coverage On\nEvercore ISI Group\n11/22/2024\nVNRX\nVolitionRX\nReiterates\nBenchmark\n11/22/2024\nUNCY\nUnicycive Therapeutics\nReiterates\nBenchmark\n11/22/2024\nACM\nAECOM\nMaintains\nTruist Securities\n11/22/2024\nICFI\nICF International\nMaintains\nTruist Securities\n11/22/2024\nADSK\nAutodesk\nMaintains\nWells Fargo\n11/22/2024\nBAH\nBooz Allen Hamilton\nMaintains\nTruist Securities\n11/22/2024\nLDOS\nLeidos Holdings\nMaintains\nTruist Securities\n11/22/2024\nNTAP\nNetApp\nMaintains\nWells Fargo\n11/22/2024\nPSN\nParsons\nMaintains\nTruist Securities\n11/22/2024\nESTC\nElastic\nMaintains\nWells Fargo\n11/22/2024\nPG\nProcter & Gamble\nMaintains\nWells Fargo\n11/22/2024\nCACI\nCACI International\nMaintains\nTruist Securities\n11/22/2024\nGAP\nGap\nMaintains\nWells Fargo\n11/22/2024\nCDXS\nCodexis\nReiterates\nCantor Fitzgerald\n11/22/2024\nKROS\nKeros Therapeutics\nReiterates\nCantor Fitzgerald\n11/22/2024\nWMG\nWarner Music Gr\nMaintains\nBarclays\n11/22/2024\nWMT\nWalmart\nMaintains\nBarclays\n11/22/2024\nGAP\nGap\nMaintains\nBarclays\n11/22/2024\nRGA\nReinsurance Gr\nMaintains\nBarclays\n11/22/2024\nPCOR\nProcore Technologies\nMaintains\nBarclays\n11/22/2024\nNTAP\nNetApp\nMaintains\nBarclays\n11/22/2024\nINTU\nIntuit\nMaintains\nBarclays\n11/22/2024\nPRTH\nPriority Tech Holdings\nMaintains\nLake Street\n11/22/2024\nDE\nDeere\nMaintains\nBarclays\n11/22/2024\nATKR\nAtkore\nMaintains\nLoop Capital\n11/22/2024\nACHC\nAcadia Healthcare Co\nMaintains\nBarclays\n11/22/2024\nVSTS\nVestis\nMaintains\nBarclays\n11/22/2024\nMPWR\nMonolithic Power Systems\nInitiates Coverage On\nWells Fargo\n11/22/2024\nAMPH\nAmphastar Pharma\nInitiates Coverage On\nWells Fargo\n11/22/2024\nTXN\nTexas Instruments\nInitiates Coverage On\nWells Fargo\n11/22/2024\nCDNS\nCadence Design Sys\nInitiates Coverage On\nWells Fargo\n11/22/2024\nMXL\nMaxLinear\nInitiates Coverage On\nWells Fargo\n11/22/2024\nADI\nAnalog Devices\nInitiates Coverage On\nWells Fargo\n11/22/2024\nNXPI\nNXP Semiconductors\nInitiates Coverage On\nWells Fargo\n11/22/2024\nRBLX\nRoblox\nReiterates\nRaymond James\n11/22/2024\nTHC\nTenet Healthcare\nDowngrades\nRaymond James\n11/22/2024\nHCA\nHCA Healthcare\nDowngrades\nRaymond James\n11/22/2024\nCYH\nCommunity Health Sys\nDowngrades\nRaymond James\n11/22/2024\nWAY\nWaystar Holding\nUpgrades\nRaymond James\n11/22/2024\nATKR\nAtkore\nDowngrades\nB. Riley Securities\n11/22/2024\nVKTX\nViking Therapeutics\nInitiates Coverage On\nB. Riley Securities\n11/22/2024\nKD\nKyndryl Hldgs\nMaintains\nSusquehanna\n11/22/2024\nBJ\nBJ's Wholesale Club\nMaintains\nMorgan Stanley\n11/22/2024\nZS\nZscaler\nMaintains\nKeybanc\nClose Trending Tickers bar\nAZTA\n$43.16\n-4.43%\n-2.00\nFLEX\n$41.34\n0.10%\n0.04\nPDYN\n$4.80\n4.35%\n0.20\nWPM\n$64.00\n0.30%\n0.19\nAccess Premium Tools\nSearch\nClear\nSearch\nAdvanced Search\nSymbols\nLoading...\nPrivate Companies\nLoading...\nNo Recent Tickers\nVisit a quote page and your recently viewed tickers will be displayed here.\nSearch Tickers\nAll News\nArticles\nVideo\nPodcasts\nAuthors\nSections\nColumns\n×\n×\nThis browser is no longer supported at MarketWatch. For the best MarketWatch.com experience, please update to a modern browser.\nChrome\nSafari\nFirefox\nEdge",
    "word_count": 1417,
    "extraction_method": "handle_default"
  }
]